{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/tom/Documents/GitHub/mrrobust/_drafts/mrrobust-examples/mrrobust-examples.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 6 Apr 2023, 11:07:40
{txt}
{com}. //_1
. use https://raw.github.com/remlapmot/mrrobust/master/dodata, clear
{txt}
{com}. //_2
. gen byte sel1 = (ldlcp2 < 1e-8)
{txt}
{com}. //_3
. mrforest chdbeta chdse ldlcbeta ldlcse if sel1==1, ///
> ivid(rsid) ///
> xlabel(-5,-4,-3,-2,-1,0,1,2,3,4,5)
{res}{txt}
{com}. qui gr export mrforest.svg, width(600) replace
{txt}
{com}. //_4
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, ivw fe

{col 55}{txt}Number of genotypes = {res}73
{col 39}{txt}Residual standard error constrained at 1
{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}chdbeta      {txt}{c |}
{space 4}ldlcbeta {c |}{col 14}{res}{space 2} .4815055{col 26}{space 2}  .038221{col 37}{space 1}   12.60{col 46}{space 3}0.000{col 54}{space 4} .4065938{col 67}{space 3} .5564173
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_5
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1

{col 55}{txt}Number of genotypes = {res}73
{col 47}{txt}Residual standard error = {res} 1.548
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}chdbeta      {txt}{c |}
{space 7}slope {c |}{col 14}{res}{space 2} .6173131{col 26}{space 2} .1034573{col 37}{space 1}    5.97{col 46}{space 3}0.000{col 54}{space 4} .4145405{col 67}{space 3} .8200858
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0087706{col 26}{space 2} .0054812{col 37}{space 1}   -1.60{col 46}{space 3}0.110{col 54}{space 4}-.0195136{col 67}{space 3} .0019723
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_6
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, ///
> gxse(ldlcse) heterogi

{col 44}{txt}Q_GX statistic (weighted) = {res}3454.26
{col 42}{txt}I^2_GX statistic (weighted) = {res} 97.92%
{col 55}{txt}Number of genotypes = {res}73
{col 47}{txt}Residual standard error = {res} 1.548
{col 17}{txt}Ruecker's Q for heterogeneity; chi2({res}71{txt}) = {res}170.11 {txt}(p =  {res}0.0000{txt})
{col 30}I-squared statistic = {res}58.3% {txt}(95% CI {res}45.8%{txt}, {res}67.8%{txt})
{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}chdbeta      {txt}{c |}
{space 7}slope {c |}{col 14}{res}{space 2} .6173131{col 26}{space 2} .1034573{col 37}{space 1}    5.97{col 46}{space 3}0.000{col 54}{space 4} .4145405{col 67}{space 3} .8200858
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0087706{col 26}{space 2} .0054812{col 37}{space 1}   -1.60{col 46}{space 3}0.110{col 54}{space 4}-.0195136{col 67}{space 3} .0019723
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_7
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, tdist

{col 55}{txt}Number of genotypes = {res}73
{col 47}{txt}Residual standard error = {res} 1.548
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}chdbeta      {txt}{c |}
{space 7}slope {c |}{col 14}{res}{space 2} .6173131{col 26}{space 2} .1034573{col 37}{space 1}    5.97{col 46}{space 3}0.000{col 54}{space 4} .4110251{col 67}{space 3} .8236012
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0087706{col 26}{space 2} .0054812{col 37}{space 1}   -1.60{col 46}{space 3}0.114{col 54}{space 4}-.0196998{col 67}{space 3} .0021585
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_8
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, radial

{col 55}{txt}Number of genotypes = {res}73
{col 47}{txt}Residual standard error = {res} 1.547
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}radialGD     {txt}{c |}
{space 4}radialGP {c |}{col 14}{res}{space 2}  .642582{col 26}{space 2} .1157871{col 37}{space 1}    5.55{col 46}{space 3}0.000{col 54}{space 4} .4156434{col 67}{space 3} .8695205
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.5737301{col 26}{space 2} .3545658{col 37}{space 1}   -1.62{col 46}{space 3}0.106{col 54}{space 4}-1.268666{col 67}{space 3} .1212062
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_9
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, ///
> radial heterogi

{col 55}{txt}Number of genotypes = {res}73
{col 47}{txt}Residual standard error = {res} 1.547
{col 17}{txt}Ruecker's Q for heterogeneity; chi2({res}71{txt}) = {res}169.98 {txt}(p =  {res}0.0000{txt})
{col 30}I-squared statistic = {res}58.2% {txt}(95% CI {res}45.8%{txt}, {res}67.8%{txt})
{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}radialGD     {txt}{c |}
{space 4}radialGP {c |}{col 14}{res}{space 2}  .642582{col 26}{space 2} .1157871{col 37}{space 1}    5.55{col 46}{space 3}0.000{col 54}{space 4} .4156434{col 67}{space 3} .8695205
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.5737301{col 26}{space 2} .3545658{col 37}{space 1}   -1.62{col 46}{space 3}0.106{col 54}{space 4}-1.268666{col 67}{space 3} .1212062
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_10
. mreggersimex chdbeta ldlcbeta [aw=1/chdse^2] if sel1==1, ///
> gxse(ldlcse) seed(12345) noboot
{res}
{col 55}{txt}Number of genotypes = {res}73
{col 53}{txt}Bootstrap replications = {res}0
{col 51}{txt}Simulation replications = {res}50
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}slope {c |}{col 14}{res}{space 2} .6256194{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0089987{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. qui gr export mreggersimex-plot.svg, width(600) replace
{txt}
{com}. //_11
. mreggerplot chdbeta chdse ldlcbeta ldlcse if sel1==1
{res}{txt}
{com}. qui gr export mreggerplot.svg, width(600) replace
{txt}
{com}. //_12
. mrmedian chdbeta chdse ldlcbeta ldlcse if sel1==1, weighted
{res}
{col 55}{txt}Number of genotypes = {res}73
{col 60}{txt}Replications = {res}1000
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}beta {c |}{col 14}{res}{space 2} .4582573{col 26}{space 2} .0624892{col 37}{space 1}    7.33{col 46}{space 3}0.000{col 54}{space 4} .3357807{col 67}{space 3} .5807339
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_13
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1, seed(12345)
{res}
{col 55}{txt}Number of genotypes = {res}73
{col 60}{txt}Replications = {res}1000
{col 70}{txt}Phi = {res}.25
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}beta {c |}{col 14}{res}{space 2} .4198713{col 26}{space 2} .2267297{col 37}{space 1}    1.85{col 46}{space 3}0.064{col 54}{space 4}-.0245107{col 67}{space 3} .8642533
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{col 55}{txt}Number of genotypes = {res}73
{col 60}{txt}Replications = {res}1000
{col 71}{txt}Phi = {res}.5
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}beta {c |}{col 14}{res}{space 2} .4218667{col 26}{space 2} .1981169{col 37}{space 1}    2.13{col 46}{space 3}0.033{col 54}{space 4} .0335647{col 67}{space 3} .8101688
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{col 55}{txt}Number of genotypes = {res}73
{col 60}{txt}Replications = {res}1000
{col 72}{txt}Phi = {res}1
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}beta {c |}{col 14}{res}{space 2} .4917353{col 26}{space 2} .1356432{col 37}{space 1}    3.63{col 46}{space 3}0.000{col 54}{space 4} .2258796{col 67}{space 3}  .757591
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. qui gr export mrmodalplot.svg, width(600) replace
{txt}
{com}. //_14
. mrmodal chdbeta chdse ldlcbeta ldlcse if sel1==1
{res}
{col 55}{txt}Number of genotypes = {res}73
{col 60}{txt}Replications = {res}1000
{col 72}{txt}Phi = {res}1
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}beta {c |}{col 14}{res}{space 2} .4917353{col 26}{space 2} .1314983{col 37}{space 1}    3.74{col 46}{space 3}0.000{col 54}{space 4} .2340034{col 67}{space 3} .7494672
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_15
. mrmodal chdbeta chdse ldlcbeta ldlcse if sel1==1, weighted
{res}
{col 55}{txt}Number of genotypes = {res}73
{col 60}{txt}Replications = {res}1000
{col 72}{txt}Phi = {res}1
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}beta {c |}{col 14}{res}{space 2} .4789702{col 26}{space 2}  .067441{col 37}{space 1}    7.10{col 46}{space 3}0.000{col 54}{space 4} .3467882{col 67}{space 3} .6111522
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_16
. mrmodal chdbeta chdse ldlcbeta ldlcse if sel1==1, nome
{res}
{col 55}{txt}Number of genotypes = {res}73
{col 60}{txt}Replications = {res}1000
{col 72}{txt}Phi = {res}1
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}beta {c |}{col 14}{res}{space 2} .4917353{col 26}{space 2} .1341723{col 37}{space 1}    3.66{col 46}{space 3}0.000{col 54}{space 4} .2287624{col 67}{space 3} .7547081
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_17
. mrfunnel chdbeta chdse ldlcbeta ldlcse if sel1==1, xlrange(0 10)
{res}{txt}
{com}. qui gr export mrfunnel.svg, width(600) replace
{txt}
{com}. //_18
. gen byte sel2 = (ldlcp2 < 1e-25)
{txt}
{com}. //_19
. mrleaveoneout chdbeta ldlcbeta if sel2==1, gyse(chdse) genotype(rsid) noprint
{res}{txt}
{com}. qui gr export mrleaveoneout-plot-01.svg, width(600) replace
{txt}
{com}. //_20
. mrleaveoneout chdbeta ldlcbeta hdlcbeta tgbeta if sel2==1, ///
> method(mvmr) gyse(chdse) genotype(rsid) noprint
{res}{txt}
{com}. qui gr export mrleaveoneout-plot-02.svg, width(600) replace
{txt}
{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/tom/Documents/GitHub/mrrobust/_drafts/mrrobust-examples/mrrobust-examples.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 6 Apr 2023, 11:07:54
{txt}{.-}
{smcl}
{txt}{sf}{ul off}