{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\eptmp\Documents\GitHub\mrrobust\_drafts\save-estimates\save-estimates.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 1 Feb 2022, 12:46:51
{txt}
{com}. //_1
. use https://raw.github.com/remlapmot/mrrobust/master/dodata, clear
{txt}
{com}. //_2
. gen byte sel1 = (ldlcp2 < 1e-8)
{txt}
{com}. //_3
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, ivw fe

{col 55}{txt}Number of genotypes = {res}73
{col 39}{txt}Residual standard error constrained at 1
{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}chdbeta      {txt}{c |}
{space 4}ldlcbeta {c |}{col 14}{res}{space 2} .4815055{col 26}{space 2}  .038221{col 37}{space 1}   12.60{col 46}{space 3}0.000{col 54}{space 4} .4065938{col 67}{space 3} .5564173
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. mat ivw = r(table)
{txt}
{com}. //_4
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1

{col 55}{txt}Number of genotypes = {res}73
{col 47}{txt}Residual standard error = {res} 1.548
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}chdbeta      {txt}{c |}
{space 7}slope {c |}{col 14}{res}{space 2} .6173131{col 26}{space 2} .1034573{col 37}{space 1}    5.97{col 46}{space 3}0.000{col 54}{space 4} .4145405{col 67}{space 3} .8200858
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0087706{col 26}{space 2} .0054812{col 37}{space 1}   -1.60{col 46}{space 3}0.110{col 54}{space 4}-.0195136{col 67}{space 3} .0019723
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. mat mregger = r(table)
{txt}
{com}. //_5
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, radial

{col 55}{txt}Number of genotypes = {res}73
{col 47}{txt}Residual standard error = {res} 1.547
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}radialGD     {txt}{c |}
{space 4}radialGP {c |}{col 14}{res}{space 2}  .642582{col 26}{space 2} .1157871{col 37}{space 1}    5.55{col 46}{space 3}0.000{col 54}{space 4} .4156434{col 67}{space 3} .8695205
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.5737301{col 26}{space 2} .3545658{col 37}{space 1}   -1.62{col 46}{space 3}0.106{col 54}{space 4}-1.268666{col 67}{space 3} .1212062
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. mat radial = r(table)
{txt}
{com}. //_6
. mrmodal chdbeta chdse ldlcbeta ldlcse if sel1==1, weighted
{res}
{col 55}{txt}Number of genotypes = {res}73
{col 60}{txt}Replications = {res}1000
{col 72}{txt}Phi = {res}1
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}beta {c |}{col 14}{res}{space 2} .4789702{col 26}{space 2} .0684667{col 37}{space 1}    7.00{col 46}{space 3}0.000{col 54}{space 4}  .344778{col 67}{space 3} .6131624
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. mat mode = r(table)
{txt}
{com}. //_7
. mrmedian chdbeta chdse ldlcbeta ldlcse if sel1==1, weighted
{res}
{col 55}{txt}Number of genotypes = {res}73
{col 60}{txt}Replications = {res}1000
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}beta {c |}{col 14}{res}{space 2} .4582573{col 26}{space 2} .0631822{col 37}{space 1}    7.25{col 46}{space 3}0.000{col 54}{space 4} .3344224{col 67}{space 3} .5820923
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. mat median = r(table)
{txt}
{com}. //_8
. mat dir
    {res}   median[9,1]
         mode[9,1]
       radial[9,2]
      mregger[9,2]
          ivw[9,1]
{txt}
{com}. mat list ivw
{res}
{txt}ivw[9,1]
          chdbeta:
         ldlcbeta
     b {res} .48150551
{txt}    se {res} .03822098
{txt}     z {res} 12.597937
{txt}pvalue {res} 2.167e-36
{txt}    ll {res} .40659377
{txt}    ul {res} .55641726
{txt}    df {res}         .
{txt}  crit {res}  1.959964
{txt} eform {res}         0
{reset}
{com}. mat list mregger
{res}
{txt}mregger[9,2]
           chdbeta:    chdbeta:
             slope       _cons
     b {res}  .61731315  -.00877065
{txt}    se {res}  .10345735   .00548118
{txt}     z {res}  5.9668371    -1.60014
{txt}pvalue {res}  2.419e-09   .10956752
{txt}    ll {res}  .41454047  -.01951356
{txt}    ul {res}  .82008582   .00197226
{txt}    df {res}          .           .
{txt}  crit {res}   1.959964    1.959964
{txt} eform {res}          0           0
{reset}
{com}. mat list radial
{res}
{txt}radial[9,2]
          radialGD:   radialGD:
          radialGP       _cons
     b {res}  .64258196  -.57373006
{txt}    se {res}  .11578709   .35456584
{txt}     z {res}  5.5496858    -1.61812
{txt}pvalue {res}  2.862e-08   .10563675
{txt}    ll {res}  .41564344  -1.2686663
{txt}    ul {res}  .86952048   .12120621
{txt}    df {res}          .           .
{txt}  crit {res}   1.959964    1.959964
{txt} eform {res}          0           0
{reset}
{com}. mat list mode
{res}
{txt}mode[9,1]
             beta
     b {res}  .4789702
{txt}    se {res} .06846666
{txt}     z {res} 6.9956707
{txt}pvalue {res} 2.640e-12
{txt}    ll {res} .34477802
{txt}    ul {res} .61316239
{txt}    df {res}         .
{txt}  crit {res}  1.959964
{txt} eform {res}         0
{reset}
{com}. mat list median
{res}
{txt}median[9,1]
             beta
     b {res} .45825733
{txt}    se {res} .06318225
{txt}     z {res} 7.2529445
{txt}pvalue {res} 4.078e-13
{txt}    ll {res}  .3344224
{txt}    ul {res} .58209225
{txt}    df {res}         .
{txt}  crit {res}  1.959964
{txt} eform {res}         0
{reset}
{com}. //_9
. mat output = (ivw, mregger, radial, mode, median)
{txt}
{com}. mat colnames output = ivw_beta mregger_beta mregger_cons ///
> radial_beta radial_cons mode_beta median_beta
{txt}
{com}. mat coleq output = "" "" "" "" "" "" ""
{txt}
{com}. mat output = output'
{txt}
{com}. mat list output, format(%4.3f)
{res}
{txt}output[7,9]
                   b      se       z  pvalue      ll      ul      df    crit   eform
    ivw_beta {res}  0.482   0.038  12.598   0.000   0.407   0.556       .   1.960   0.000
{txt}mregger_beta {res}  0.617   0.103   5.967   0.000   0.415   0.820       .   1.960   0.000
{txt}mregger_cons {res} -0.009   0.005  -1.600   0.110  -0.020   0.002       .   1.960   0.000
{txt} radial_beta {res}  0.643   0.116   5.550   0.000   0.416   0.870       .   1.960   0.000
{txt} radial_cons {res} -0.574   0.355  -1.618   0.106  -1.269   0.121       .   1.960   0.000
{txt}   mode_beta {res}  0.479   0.068   6.996   0.000   0.345   0.613       .   1.960   0.000
{txt} median_beta {res}  0.458   0.063   7.253   0.000   0.334   0.582       .   1.960   0.000
{reset}
{com}. //_10
. drop _all
{txt}
{com}. svmat output, names(col)
{txt}number of observations will be reset to 7
Press any key to continue, or Break to abort
{p}
Number of observations ({bf:_N}) was 0,
now 7.
{p_end}

{com}. local rownames : rownames output
{txt}
{com}. di "`rownames'"
{res}ivw_beta mregger_beta mregger_cons radial_beta radial_cons mode_beta median_beta
{txt}
{com}. tokenize `rownames'
{txt}
{com}. gen str15 estimate = ""
{txt}(7 missing values generated)

{com}. forvalues i = 1/7 {c -(}
{txt}  2{com}. replace estimate = "``i''" in `i'
{txt}  3{com}. {c )-}
{txt}(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

{com}. //_11
. list estimate b se z pvalue ll ul, clean noobs
{txt}
    {res}    estimate           b         se          z     pvalue          ll         ul {txt} 
    {res}    ivw_beta    .4815055    .038221   12.59794   2.17e-36    .4065938   .5564172 {txt} 
    {res}mregger_beta    .6173131   .1034573   5.966837   2.42e-09    .4145405   .8200858 {txt} 
    {res}mregger_cons   -.0087707   .0054812   -1.60014   .1095675   -.0195136   .0019723 {txt} 
    {res} radial_beta    .6425819   .1157871   5.549686   2.86e-08    .4156434   .8695205 {txt} 
    {res} radial_cons   -.5737301   .3545658   -1.61812   .1056367   -1.268666   .1212062 {txt} 
    {res}   mode_beta    .4789702   .0684667   6.995671   2.64e-12     .344778   .6131624 {txt} 
    {res} median_beta    .4582573   .0631822   7.252944   4.08e-13    .3344224   .5820922 {txt} 

{com}. //_12
. save myestimates, replace
{txt}{p 0 4 2}
file {bf}
myestimates.dta{rm}
saved
{p_end}

{com}. //_13
. export delimited using myestimates.txt, delimiter(tab) replace
{res}{txt}file {bf:myestimates.txt} saved

{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\eptmp\Documents\GitHub\mrrobust\_drafts\save-estimates\save-estimates.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 1 Feb 2022, 12:46:52
{txt}{.-}
{smcl}
{txt}{sf}{ul off}