{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/tom/Documents/GitHub/mrrobust/_drafts/spiller-ije-2018-examples/spiller-ije-2018-examples.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 6 Apr 2023, 07:20:04
{txt}
{com}. //_1
. import delimited using BMI.csv, clear
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(41 vars, 79 obs)

{com}. //_2
. mregger betaoutcome betaexposure [aw=1/(seoutcome^2)], ivw

{col 55}{txt}Number of genotypes = {res}79
{col 47}{txt}Residual standard error = {res} 1.039
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}betaoutcome  {txt}{c |}
betaexposure {c |}{col 14}{res}{space 2} .0231866{col 26}{space 2} .0079957{col 37}{space 1}    2.90{col 46}{space 3}0.004{col 54}{space 4} .0075154{col 67}{space 3} .0388578
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_3
. mregger betaoutcome betaexposure [aw=1/(seoutcome^2)]

{col 55}{txt}Number of genotypes = {res}79
{col 47}{txt}Residual standard error = {res} 1.046
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}betaoutcome  {txt}{c |}
{space 7}slope {c |}{col 14}{res}{space 2} .0218507{col 26}{space 2} .0221852{col 37}{space 1}    0.98{col 46}{space 3}0.325{col 54}{space 4}-.0216315{col 67}{space 3} .0653329
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  .000038{col 26}{space 2} .0005877{col 37}{space 1}    0.06{col 46}{space 3}0.948{col 54}{space 4}-.0011138{col 67}{space 3} .0011897
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_4
. mreggerplot betaoutcome seoutcome betaexposure seexposure
{res}{txt}
{com}. qui gr export mreggerplot-bmi.svg, width(600) replace
{txt}
{com}. //_5
. mrmedian betaoutcome seoutcome betaexposure seexposure, ///
>     weighted seed(300818)
{res}
{col 55}{txt}Number of genotypes = {res}79
{col 60}{txt}Replications = {res}1000
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}beta {c |}{col 14}{res}{space 2} .0339256{col 26}{space 2} .0120248{col 37}{space 1}    2.82{col 46}{space 3}0.005{col 54}{space 4} .0103576{col 67}{space 3} .0574937
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_6
. mrmodalplot betaoutcome seoutcome betaexposure seexposure, ///
>     lc(gs10 gs5 gs0) seed(300818)
{res}
{col 55}{txt}Number of genotypes = {res}79
{col 60}{txt}Replications = {res}1000
{col 70}{txt}Phi = {res}.25
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}beta {c |}{col 14}{res}{space 2} .0374507{col 26}{space 2} .0424036{col 37}{space 1}    0.88{col 46}{space 3}0.377{col 54}{space 4}-.0456588{col 67}{space 3} .1205602
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{col 55}{txt}Number of genotypes = {res}79
{col 60}{txt}Replications = {res}1000
{col 71}{txt}Phi = {res}.5
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}beta {c |}{col 14}{res}{space 2} .0416424{col 26}{space 2} .0369758{col 37}{space 1}    1.13{col 46}{space 3}0.260{col 54}{space 4}-.0308289{col 67}{space 3} .1141137
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{col 55}{txt}Number of genotypes = {res}79
{col 60}{txt}Replications = {res}1000
{col 72}{txt}Phi = {res}1
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}beta {c |}{col 14}{res}{space 2} .0431816{col 26}{space 2} .0281684{col 37}{space 1}    1.53{col 46}{space 3}0.125{col 54}{space 4}-.0120274{col 67}{space 3} .0983906
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. qui gr export mrmodalplot-bmi.svg, width(600) replace
{txt}
{com}. //_7
. import delimited using Height.csv, clear
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(41 vars, 367 obs)

{com}. //_8
. mregger betaoutcome betaexposure [aw=1/(seoutcome^2)], ivw

{col 54}{txt}Number of genotypes = {res}367
{col 47}{txt}Residual standard error = {res} 1.044
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}betaoutcome  {txt}{c |}
betaexposure {c |}{col 14}{res}{space 2} .0015412{col 26}{space 2} .0033017{col 37}{space 1}    0.47{col 46}{space 3}0.641{col 54}{space 4}  -.00493{col 67}{space 3} .0080124
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_9
. mregger betaoutcome betaexposure [aw=1/(seoutcome^2)]

{col 54}{txt}Number of genotypes = {res}367
{col 47}{txt}Residual standard error = {res} 1.045
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}betaoutcome  {txt}{c |}
{space 7}slope {c |}{col 14}{res}{space 2}-.0025878{col 26}{space 2} .0091178{col 37}{space 1}   -0.28{col 46}{space 3}0.777{col 54}{space 4}-.0204584{col 67}{space 3} .0152828
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0001338{col 26}{space 2} .0002754{col 37}{space 1}    0.49{col 46}{space 3}0.627{col 54}{space 4} -.000406{col 67}{space 3} .0006736
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_10
. mreggerplot betaoutcome seoutcome betaexposure seexposure
{res}{txt}
{com}. qui gr export mreggerplot-height.svg, width(600) replace
{txt}
{com}. //_11
. mrmedian betaoutcome seoutcome betaexposure seexposure, ///
>     weighted seed(300818)
{res}
{col 54}{txt}Number of genotypes = {res}367
{col 60}{txt}Replications = {res}1000
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}beta {c |}{col 14}{res}{space 2}        0{col 26}{space 2} .0052323{col 37}{space 1}    0.00{col 46}{space 3}1.000{col 54}{space 4}-.0102551{col 67}{space 3} .0102551
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_12
. mrmodalplot betaoutcome seoutcome betaexposure seexposure, ///
>     lc(gs10 gs5 gs0) seed(300818)
{res}
{col 54}{txt}Number of genotypes = {res}367
{col 60}{txt}Replications = {res}1000
{col 70}{txt}Phi = {res}.25
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}beta {c |}{col 14}{res}{space 2} .0061368{col 26}{space 2} .0245472{col 37}{space 1}    0.25{col 46}{space 3}0.803{col 54}{space 4}-.0419748{col 67}{space 3} .0542484
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{col 54}{txt}Number of genotypes = {res}367
{col 60}{txt}Replications = {res}1000
{col 71}{txt}Phi = {res}.5
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}beta {c |}{col 14}{res}{space 2} .0015595{col 26}{space 2} .0212232{col 37}{space 1}    0.07{col 46}{space 3}0.941{col 54}{space 4}-.0400372{col 67}{space 3} .0431561
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{col 54}{txt}Number of genotypes = {res}367
{col 60}{txt}Replications = {res}1000
{col 72}{txt}Phi = {res}1
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}beta {c |}{col 14}{res}{space 2}-.0054772{col 26}{space 2} .0149074{col 37}{space 1}   -0.37{col 46}{space 3}0.713{col 54}{space 4}-.0346952{col 67}{space 3} .0237408
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. qui gr export mrmodalplot-height.svg, width(600) replace
{txt}
{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/tom/Documents/GitHub/mrrobust/_drafts/spiller-ije-2018-examples/spiller-ije-2018-examples.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 6 Apr 2023, 07:20:09
{txt}{.-}
{smcl}
{txt}{sf}{ul off}