-------------------------------------------------------------------------------
      name:  mr
       log:  C:\Users\eptmp\Documents\GitHub\mrrobust\cscripts\mr.log
  log type:  text
 opened on:   1 Feb 2022, 11:09:08

. * mr cscript
. * 20jan2020
. 
. cscript mr adofiles ///
> mrmvegger ///
> mrmvivw ///
> mr ///
> mrdeps ///
> mregger ///
> mreggerplot ///
> mreggersimex ///
> mreggersimexonce ///
> mrforest ///
> mrfunnel ///
> mrivests ///
> mrmedian ///
> mrmedianobs ///
> mrmedianobs_work ///
> mrmodal ///
> mrmodalplot ///
> mrratio
-----------------------------------------------------------------------BEGIN mr

-> which mrmvegger, usesysdir
C:\Users\eptmp\Documents\GitHub\mrrobust\mrmvegger.ado
*! version 0.1.0 23jun2020 Tom Palmer

-> which mrmvivw, usesysdir
C:\Users\eptmp\Documents\GitHub\mrrobust\mrmvivw.ado
*! version 0.1.0 22jun2020 Tom Palmer

-> which mr, usesysdir
C:\Users\eptmp\Documents\GitHub\mrrobust\mr.ado
*! version 0.1.0 19jan2020 Tom Palmer

-> which mrdeps, usesysdir
C:\Users\eptmp\Documents\GitHub\mrrobust\mrdeps.ado
*! version 0.1.0 18dec2018 Tom Palmer

-> which mregger, usesysdir
C:\Users\eptmp\Documents\GitHub\mrrobust\mregger.ado
*! version 0.1.0 04jun2016 Tom Palmer

-> which mreggerplot, usesysdir
C:\Users\eptmp\Documents\GitHub\mrrobust\mreggerplot.ado
*! version 0.1.0 Tom Palmer 06jun2016

-> which mreggersimex, usesysdir
C:\Users\eptmp\Documents\GitHub\mrrobust\mreggersimex.ado
*! 0.1.0 20jul2017 Tom Palmer

-> which mreggersimexonce, usesysdir
C:\Users\eptmp\Documents\GitHub\mrrobust\mreggersimexonce.ado
*! 0.1.0 23jul2017 Tom Palmer

-> which mrforest, usesysdir
C:\Users\eptmp\Documents\GitHub\mrrobust\mrforest.ado
*! version 0.1.0 Tom Palmer 15jun2017

-> which mrfunnel, usesysdir
C:\Users\eptmp\Documents\GitHub\mrrobust\mrfunnel.ado
*! 0.1.0 Tom Palmer 29aug2017

-> which mrivests, usesysdir
C:\Users\eptmp\Documents\GitHub\mrrobust\mrivests.ado
*! 0.1.0 Tom Palmer 10jun2017

-> which mrmedian, usesysdir
C:\Users\eptmp\Documents\GitHub\mrrobust\mrmedian.ado
*! version 0.1.0 03jun2016 Tom Palmer

-> which mrmedianobs, usesysdir
C:\Users\eptmp\Documents\GitHub\mrrobust\mrmedianobs.ado
*! version 0.1.0 04jun2016 Tom Palmer

-> which mrmedianobs_work, usesysdir
C:\Users\eptmp\Documents\GitHub\mrrobust\mrmedianobs_work.ado
*! version 0.1.0 04jun2016 Tom Palmer

-> which mrmodal, usesysdir
C:\Users\eptmp\Documents\GitHub\mrrobust\mrmodal.ado
*! version 0.1.0 02jun2017 Tom Palmer

-> which mrmodalplot, usesysdir
C:\Users\eptmp\Documents\GitHub\mrrobust\mrmodalplot.ado
*! 0.1.0 2aug2017 Tom Palmer

-> which mrratio, usesysdir
C:\Users\eptmp\Documents\GitHub\mrrobust\mrratio.ado
*! 1.0.0 Tom Palmer 30may2017, based on my old tsci.ado from 8jan2010

. 
. rcof "noi mr incorrectsubcommandname" == 198
incorrectsubcommandname is not a valid subcommand.

. 
. mr deps
checking addplot consistency and verifying not already installed...
all files already exist and are up to date.
checking kdens consistency and verifying not already installed...
all files already exist and are up to date.
checking moremata consistency and verifying not already installed...
all files already exist and are up to date.
checking heterogi consistency and verifying not already installed...
all files already exist and are up to date.
checking metan consistency and verifying not already installed...
all files already exist and are up to date.
checking grc1leg consistency and verifying not already installed...
all files already exist and are up to date.

. 
. ** Do et al. dataset
. 
. use https://raw.github.com/remlapmot/mrrobust/master/dodata, clear

. gen byte sel1 = (ldlcp2 < 1e-8)

. 
. mr egger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, ivw fe

                                                      Number of genotypes = 73
                                      Residual standard error constrained at 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .4815055    .038221    12.60   0.000     .4065938    .5564173
------------------------------------------------------------------------------

. 
. mr eggerplot chdbeta chdse ldlcbeta ldlcse if sel1==1

. 
. mr eggersimex chdbeta ldlcbeta [aw=1/chdse^2] if sel1==1, gxse(ldlcse) seed(1
> 2345) noboot

                                                      Number of genotypes = 73
                                                    Bootstrap replications = 0
                                                  Simulation replications = 50
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       slope |   .6256194          .        .       .            .           .
       _cons |  -.0089987          .        .       .            .           .
------------------------------------------------------------------------------

. 
. mr forest chdbeta chdse ldlcbeta ldlcse if sel1==1, ivid(rsid)

. 
. mr funnel chdbeta chdse ldlcbeta ldlcse if sel1==1

. 
. mr ivests chdbeta chdse ldlcbeta ldlcse if sel1==1, generate(ivest ivse)

. 
. mr median chdbeta chdse ldlcbeta ldlcse if sel1==1

                                                      Number of genotypes = 73
                                                           Replications = 1000
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4285714   .0715535     5.99   0.000     .2883292    .5688136
------------------------------------------------------------------------------

. 
. mr modal chdbeta chdse ldlcbeta ldlcse if sel1==1, weighted

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4789702   .0652193     7.34   0.000     .3511427    .6067977
------------------------------------------------------------------------------

. 
. mr modalplot chdbeta chdse ldlcbeta ldlcse if sel1==1

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                     Phi = .25
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4198713   .2332927     1.80   0.072     -.037374    .8771166
------------------------------------------------------------------------------

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                      Phi = .5
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4218667   .1905195     2.21   0.027     .0484554    .7952781
------------------------------------------------------------------------------

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4917353   .1312092     3.75   0.000     .2345699    .7489007
------------------------------------------------------------------------------

. 
. mr ratio 1 .5 1 .25, eform

------------------------------------------------------------------------------
             |      exp()   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   2.718282   1.519566     1.79   0.074     .9087791     8.13075
------------------------------------------------------------------------------

. 
. ** mv estimators
. 
. mr mvivw chdbeta ldlcbeta hdlcbeta tgbeta [aw=1/(chdse^2)] if sel1==1

                                                      Number of genotypes = 73
                                                      Number of phenotypes = 3
                                                Standard errors: Random effect
                                              Residual standard error =  1.490
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |     .42862   .0609661     7.03   0.000     .3091286    .5481113
    hdlcbeta |  -.1941989   .1308289    -1.48   0.138    -.4506189    .0622211
      tgbeta |   .2260456   .1232828     1.83   0.067    -.0155842    .4676755
------------------------------------------------------------------------------

. 
. mr mvegger chdbeta ldlcbeta hdlcbeta tgbeta [aw=1/(chdse^2)] if sel1==1

                                       MVMR-Egger model oriented wrt: ldlcbeta
                                                      Number of genotypes = 73
                                                      Number of phenotypes = 3
                                              Residual standard error =  1.469
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .5672993   .1002611     5.66   0.000      .370791    .7638075
    hdlcbeta |  -.1364113   .1332727    -1.02   0.306    -.3976209    .1247983
      tgbeta |   .2739803   .1246927     2.20   0.028     .0295871    .5183735
       _cons |  -.0093655   .0054187    -1.73   0.084     -.019986     .001255
------------------------------------------------------------------------------

. 
. mr mvegger chdbeta ldlcbeta hdlcbeta tgbeta [aw=1/(chdse^2)] if sel1==1, orie
> nt(2)

                                       MVMR-Egger model oriented wrt: hdlcbeta
                                                      Number of genotypes = 73
                                                      Number of phenotypes = 3
                                              Residual standard error =  1.501
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .4286398   .0614056     6.98   0.000      .308287    .5489926
    hdlcbeta |  -.1989637   .1541909    -1.29   0.197    -.5011723    .1032449
      tgbeta |   .2256794   .1243221     1.82   0.069    -.0179875    .4693463
       _cons |   .0002155   .0036218     0.06   0.953     -.006883    .0073141
------------------------------------------------------------------------------

. 
. gen byte sel2 = (ldlcp2 < 1e-25)

. mr leaveoneout chdbeta ldlcbeta if sel2==1, gyse(chdse) genotype(rsid)

Model fitted without genotype: rs1998013

                                                      Number of genotypes = 20
                                      Residual standard error constrained at 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .5282376   .0455961    11.59   0.000     .4388709    .6176042
------------------------------------------------------------------------------

Model fitted without genotype: rs4587594

                                                      Number of genotypes = 20
                                      Residual standard error constrained at 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .5429584   .0453622    11.97   0.000     .4540502    .6318666
------------------------------------------------------------------------------

Model fitted without genotype: rs646776

                                                      Number of genotypes = 20
                                      Residual standard error constrained at 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .5107593   .0493613    10.35   0.000     .4140128    .6075057
------------------------------------------------------------------------------

Model fitted without genotype: rs2587534

                                                      Number of genotypes = 20
                                      Residual standard error constrained at 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .5344288   .0453062    11.80   0.000     .4456302    .6232274
------------------------------------------------------------------------------

Model fitted without genotype: rs1367117

                                                      Number of genotypes = 20
                                      Residual standard error constrained at 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |    .556469   .0479046    11.62   0.000     .4625777    .6503603
------------------------------------------------------------------------------

Model fitted without genotype: rs515135

                                                      Number of genotypes = 20
                                      Residual standard error constrained at 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .5320207   .0474703    11.21   0.000     .4389807    .6250607
------------------------------------------------------------------------------

Model fitted without genotype: rs6544713

                                                      Number of genotypes = 20
                                      Residual standard error constrained at 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .5122364   .0460225    11.13   0.000     .4220338    .6024389
------------------------------------------------------------------------------

Model fitted without genotype: rs7703051

                                                      Number of genotypes = 20
                                      Residual standard error constrained at 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .5281236    .046125    11.45   0.000     .4377202     .618527
------------------------------------------------------------------------------

Model fitted without genotype: rs6882076

                                                      Number of genotypes = 20
                                      Residual standard error constrained at 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .5254465   .0453343    11.59   0.000      .436593    .6143001
------------------------------------------------------------------------------

Model fitted without genotype: rs4240624

                                                      Number of genotypes = 20
                                      Residual standard error constrained at 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .5271701   .0452075    11.66   0.000      .438565    .6157752
------------------------------------------------------------------------------

Model fitted without genotype: rs2954022

                                                      Number of genotypes = 20
                                      Residual standard error constrained at 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .5081094   .0455969    11.14   0.000     .4187411    .5974778
------------------------------------------------------------------------------

Model fitted without genotype: rs579459

                                                      Number of genotypes = 20
                                      Residual standard error constrained at 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |    .498307   .0454897    10.95   0.000     .4091488    .5874652
------------------------------------------------------------------------------

Model fitted without genotype: rs1535

                                                      Number of genotypes = 20
                                      Residual standard error constrained at 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .5364546   .0454439    11.80   0.000     .4473862    .6255229
------------------------------------------------------------------------------

Model fitted without genotype: rs10790162

                                                      Number of genotypes = 20
                                      Residual standard error constrained at 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .5053214   .0452312    11.17   0.000     .4166699    .5939729
------------------------------------------------------------------------------

Model fitted without genotype: rs2000999

                                                      Number of genotypes = 20
                                      Residual standard error constrained at 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .5217204   .0454508    11.48   0.000     .4326384    .6108024
------------------------------------------------------------------------------

Model fitted without genotype: rs6511720

                                                      Number of genotypes = 20
                                      Residual standard error constrained at 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .5182714    .046783    11.08   0.000     .4265784    .6099643
------------------------------------------------------------------------------

Model fitted without genotype: rs688

                                                      Number of genotypes = 20
                                      Residual standard error constrained at 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .5084139   .0455576    11.16   0.000     .4191226    .5977051
------------------------------------------------------------------------------

Model fitted without genotype: rs10401969

                                                      Number of genotypes = 20
                                      Residual standard error constrained at 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .5106048    .045641    11.19   0.000     .4211501    .6000594
------------------------------------------------------------------------------

Model fitted without genotype: rs6859

                                                      Number of genotypes = 20
                                      Residual standard error constrained at 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .5346733   .0456701    11.71   0.000     .4451615     .624185
------------------------------------------------------------------------------

Model fitted without genotype: rs7254892

                                                      Number of genotypes = 20
                                      Residual standard error constrained at 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .5422596   .0465593    11.65   0.000      .451005    .6335142
------------------------------------------------------------------------------

Model fitted without genotype: rs6065311

                                                      Number of genotypes = 20
                                      Residual standard error constrained at 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .5254198   .0452998    11.60   0.000     .4366339    .6142056
------------------------------------------------------------------------------

Model fitted to all genotypes

                                                      Number of genotypes = 21
                                      Residual standard error constrained at 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .5240663   .0448781    11.68   0.000     .4361069    .6120257
------------------------------------------------------------------------------

. 
. ** mrmedianobs test dataset
. 
. use https://raw.github.com/remlapmot/mrrobust/master/mrmedianobs_testdata, cl
> ear

. mr medianobs y (x = z1-z20), weighted

                                                      Number of genotypes = 20
                                                          Number of obs = 1000
                                                             Replications = 50
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .9987268   .0633445    15.77   0.000     .8745738     1.12288
------------------------------------------------------------------------------

. 
end of do-file
      name:  mr
       log:  C:\Users\eptmp\Documents\GitHub\mrrobust\cscripts\mr.log
  log type:  text
 closed on:   1 Feb 2022, 11:10:08
-------------------------------------------------------------------------------
