-------------------------------------------------------------------------------
      name:  mregger
       log:  C:\Users\eptmp\Documents\GitHub\mrrobust\cscripts\mregger.log
  log type:  text
 opened on:  26 Apr 2021, 11:36:33

. * mregger cscript
. * 04jun2016
. 
. cscript mregger adofiles mregger
------------------------------------------------------------------BEGIN mregger

-> which mregger, usesysdir
C:\Users\eptmp\Documents\GitHub\mrrobust\mregger.ado
*! version 0.1.0 04jun2016 Tom Palmer

. 
. *** load in dataset
. use https://raw.github.com/remlapmot/mrrobust/master/dodata, clear

. 
. *** ldlc - analysis 1
. gen byte sel1 = (ldlcp2 < 1e-8)

. 
. *** ivw
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, ivw

                                                      Number of genotypes = 73
                                              Residual standard error =  1.565
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .4815055   .0597994     8.05   0.000     .3643009    .5987101
------------------------------------------------------------------------------

. assert abs(_b[ldlcbeta] - .482) < 1e-3

. assert abs(_se[ldlcbeta] - 0.060) < 1e-3

. 
. * r(table)
. mat list r(table)

r(table)[9,1]
          chdbeta:
         ldlcbeta
     b  .48150551
    se  .05979938
     z  8.0520154
pvalue  8.144e-16
    ll  .36430088
    ul  .59871014
    df          .
  crit   1.959964
 eform          0

. 
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1

                                                      Number of genotypes = 73
                                              Residual standard error =  1.548
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
       slope |   .6173131   .1034573     5.97   0.000     .4145405    .8200858
       _cons |  -.0087706   .0054812    -1.60   0.110    -.0195136    .0019723
------------------------------------------------------------------------------

. mat list r(table)

r(table)[9,2]
           chdbeta:    chdbeta:
             slope       _cons
     b   .61731315  -.00877065
    se   .10345735   .00548118
     z   5.9668371    -1.60014
pvalue   2.419e-09   .10956752
    ll   .41454047  -.01951356
    ul   .82008582   .00197226
    df           .           .
  crit    1.959964    1.959964
 eform           0           0

. 
. discard

. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, heterogi

                                                      Number of genotypes = 73
                                              Residual standard error =  1.548
                Ruecker's Q for heterogeneity; chi2(71) = 170.11 (p =  0.0000)
                                 I-squared statistic: 0.58 (95% CI 0.46, 0.68)
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
       slope |   .6173131   .1034573     5.97   0.000     .4145405    .8200858
       _cons |  -.0087706   .0054812    -1.60   0.110    -.0195136    .0019723
------------------------------------------------------------------------------

. mat list r(table)

r(table)[9,2]
           chdbeta:    chdbeta:
             slope       _cons
     b   .61731315  -.00877065
    se   .10345735   .00548118
     z   5.9668371    -1.60014
pvalue   2.419e-09   .10956752
    ll   .41454047  -.01951356
    ul   .82008582   .00197226
    df           .           .
  crit    1.959964    1.959964
 eform           0           0

. 
. discard

. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, heterogi radial

                                                      Number of genotypes = 73
                                              Residual standard error =  1.547
                Ruecker's Q for heterogeneity; chi2(71) = 169.98 (p =  0.0000)
                                 I-squared statistic: 0.58 (95% CI 0.46, 0.68)
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
radialGD     |
    radialGP |    .642582   .1157871     5.55   0.000     .4156434    .8695205
       _cons |  -.5737301   .3545658    -1.62   0.106    -1.268666    .1212062
------------------------------------------------------------------------------

. mat list r(table)

r(table)[9,2]
          radialGD:   radialGD:
          radialGP       _cons
     b   .64258196  -.57373006
    se   .11578709   .35456584
     z   5.5496858    -1.61812
pvalue   2.862e-08   .10563675
    ll   .41564344  -1.2686663
    ul   .86952048   .12120621
    df           .           .
  crit    1.959964    1.959964
 eform           0           0

. 
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, gxse(ldlcse) heterogi

                                           Q_GX statistic (weighted) = 3454.26
                                         I^2_GX statistic (weighted) =  97.92%
                                                      Number of genotypes = 73
                                              Residual standard error =  1.548
                Ruecker's Q for heterogeneity; chi2(71) = 170.11 (p =  0.0000)
                                 I-squared statistic: 0.58 (95% CI 0.46, 0.68)
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
       slope |   .6173131   .1034573     5.97   0.000     .4145405    .8200858
       _cons |  -.0087706   .0054812    -1.60   0.110    -.0195136    .0019723
------------------------------------------------------------------------------

. mat list r(table)

r(table)[9,2]
           chdbeta:    chdbeta:
             slope       _cons
     b   .61731315  -.00877065
    se   .10345735   .00548118
     z   5.9668371    -1.60014
pvalue   2.419e-09   .10956752
    ll   .41454047  -.01951356
    ul   .82008582   .00197226
    df           .           .
  crit    1.959964    1.959964
 eform           0           0

. 
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, gxse(ldlcse)

                                           Q_GX statistic (weighted) = 3454.26
                                         I^2_GX statistic (weighted) =  97.92%
                                                      Number of genotypes = 73
                                              Residual standard error =  1.548
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
       slope |   .6173131   .1034573     5.97   0.000     .4145405    .8200858
       _cons |  -.0087706   .0054812    -1.60   0.110    -.0195136    .0019723
------------------------------------------------------------------------------

. mat list r(table)

r(table)[9,2]
           chdbeta:    chdbeta:
             slope       _cons
     b   .61731315  -.00877065
    se   .10345735   .00548118
     z   5.9668371    -1.60014
pvalue   2.419e-09   .10956752
    ll   .41454047  -.01951356
    ul   .82008582   .00197226
    df           .           .
  crit    1.959964    1.959964
 eform           0           0

. 
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, radial

                                                      Number of genotypes = 73
                                              Residual standard error =  1.547
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
radialGD     |
    radialGP |    .642582   .1157871     5.55   0.000     .4156434    .8695205
       _cons |  -.5737301   .3545658    -1.62   0.106    -1.268666    .1212062
------------------------------------------------------------------------------

. mat list r(table)

r(table)[9,2]
          radialGD:   radialGD:
          radialGP       _cons
     b   .64258196  -.57373006
    se   .11578709   .35456584
     z   5.5496858    -1.61812
pvalue   2.862e-08   .10563675
    ll   .41564344  -1.2686663
    ul   .86952048   .12120621
    df           .           .
  crit    1.959964    1.959964
 eform           0           0

. 
. version 12: mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, ivw

                                                      Number of genotypes = 73
                                              Residual standard error =  1.565
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .4815055   .0597994     8.05   0.000     .3643009    .5987101
------------------------------------------------------------------------------

. assert abs(_b[ldlcbeta] - .482) < 1e-3

. assert abs(_se[ldlcbeta] - 0.060) < 1e-3

. 
. * check directional adjustment does not affect estimates
. gen double ycheck = chdbeta*sign(ldlcbeta)

. gen double xcheck = abs(ldlcbeta)

. regress ycheck xcheck [aw=1/(chdse^2)] if sel1==1, nocons
(sum of wgt is 243,877.358297371)

      Source |       SS           df       MS      Number of obs   =        73
-------------+----------------------------------   F(1, 72)        =     64.83
       Model |  .047506198         1  .047506198   Prob > F        =    0.0000
    Residual |  .052756209        72  .000732725   R-squared       =    0.4738
-------------+----------------------------------   Adj R-squared   =    0.4665
       Total |  .100262406        73  .001373458   Root MSE        =    .02707

------------------------------------------------------------------------------
      ycheck |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      xcheck |   .4815055   .0597994     8.05   0.000     .3622976    .6007134
------------------------------------------------------------------------------

. assert abs(_b[xcheck] - .482) < 1e-3

. assert abs(_se[xcheck] - 0.060) < 1e-3

. 
. *** mregger
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1

                                                      Number of genotypes = 73
                                              Residual standard error =  1.548
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
       slope |   .6173131   .1034573     5.97   0.000     .4145405    .8200858
       _cons |  -.0087706   .0054812    -1.60   0.110    -.0195136    .0019723
------------------------------------------------------------------------------

. assert abs(_b[slope] - .617) < 1e-3

. assert abs(_b[_cons] - -.009) < 1e-3

. eret list

scalars:
               e(df_r) =  .
                e(phi) =  1.547885800541125
                  e(k) =  73

macros:
            e(cmdline) : "mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1.."
                e(cmd) : "mregger"
         e(properties) : "b V"

matrices:
                  e(b) :  1 x 2
                  e(V) :  2 x 2

. mregger
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
       slope |   .6173131   .1034573     5.97   0.000     .4145405    .8200858
       _cons |  -.0087706   .0054812    -1.60   0.110    -.0195136    .0019723
------------------------------------------------------------------------------

. eret list

scalars:
               e(df_r) =  .
                e(phi) =  1.547885800541125
                  e(k) =  73

macros:
            e(cmdline) : "mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1.."
                e(cmd) : "mregger"
         e(properties) : "b V"

matrices:
                  e(b) :  1 x 2
                  e(V) :  2 x 2

. 
. version 12: mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1

                                                      Number of genotypes = 73
                                              Residual standard error =  1.548
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
       slope |   .6173131   .1034573     5.97   0.000     .4145405    .8200858
       _cons |  -.0087706   .0054812    -1.60   0.110    -.0195136    .0019723
------------------------------------------------------------------------------

. assert abs(_b[slope] - .617) < 1e-3

. assert abs(_b[_cons] - -.009) < 1e-3

. 
. *** test replay
. mregger
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
       slope |   .6173131   .1034573     5.97   0.000     .4145405    .8200858
       _cons |  -.0087706   .0054812    -1.60   0.110    -.0195136    .0019723
------------------------------------------------------------------------------

. 
. ** ci level
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, level(90)

                                                      Number of genotypes = 73
                                              Residual standard error =  1.548
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [90% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
       slope |   .6173131   .1034573     5.97   0.000      .447141    .7874853
       _cons |  -.0087706   .0054812    -1.60   0.110    -.0177864    .0002451
------------------------------------------------------------------------------

. 
. *** fe standard errors (default is multiplicative)
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, fe

                                                      Number of genotypes = 73
                                      Residual standard error constrained at 1
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
       slope |   .6173131   .0668378     9.24   0.000     .4863134    .7483129
       _cons |  -.0087706   .0035411    -2.48   0.013     -.015711   -.0018303
------------------------------------------------------------------------------

. 
. version 12: mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, fe

                                                      Number of genotypes = 73
                                      Residual standard error constrained at 1
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
       slope |   .6173131   .0668378     9.24   0.000     .4863134    .7483129
       _cons |  -.0087706   .0035411    -2.48   0.013     -.015711   -.0018303
------------------------------------------------------------------------------

. 
. *** re
. /*
> mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, re noestimate
> mat b = e(b)
> mat b[1,1] = .575
> mat b[1,2] = -.0065
> mat b[1,6] = .0046
> mat b[1,7] = .0026
> mat b[1,8] = -.00067
> mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, re from(b)
> eret list
> */
. 
. *** ivw fe SEs
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, ivw fe

                                                      Number of genotypes = 73
                                      Residual standard error constrained at 1
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .4815055    .038221    12.60   0.000     .4065938    .5564173
------------------------------------------------------------------------------

. 
. version 12: mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, ivw fe

                                                      Number of genotypes = 73
                                      Residual standard error constrained at 1
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .4815055    .038221    12.60   0.000     .4065938    .5564173
------------------------------------------------------------------------------

. 
. *** ivw re
. /*
> mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, ivw re noestimate
> mat b = e(b)
> mat b[1,1] = .417
> mat b[1,4] = .218
> mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, ivw re from(b)
> */
. 
. rcof "version 12: noi mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, r
> e" ///
>         == 9
option re requires Stata version 13 or higher

. 
. rcof "noi mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, ivw recons" /
> //
>         == 198
option  recons must be specified with option re

. 
. rcof "noi mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, ivw reslope" 
> ///
>         == 198
option reslope  must be specified with option re

. 
. rcof "noi mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, ivw recons re
> slope" ///
>         == 198
option reslope recons must be specified with option re

. 
. rcof "noi mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, ivw re recons
> " == 198
For IVW estimator option recons not allowed for re estimation (as there is no c
> onstant)

. 
. * mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, re recons
. 
. *** reslope
. * mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, re reslope
. 
. *** both
. /*
> mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, re recons reslope noest
> imate
> mat b = e(b)
> mat b[1,1] = .575
> mat b[1,2] = -.0065
> mat b[1,6] = .0046
> mat b[1,7] = .0026
> mat b[1,8] = -.00067
> mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, re recons reslope from(
> b)
> */
. 
. *** gsemopts
. * mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, re recons vce(robust)
. 
. * level
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, level(90)

                                                      Number of genotypes = 73
                                              Residual standard error =  1.548
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [90% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
       slope |   .6173131   .1034573     5.97   0.000      .447141    .7874853
       _cons |  -.0087706   .0054812    -1.60   0.110    -.0177864    .0002451
------------------------------------------------------------------------------

. mregger
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
       slope |   .6173131   .1034573     5.97   0.000     .4145405    .8200858
       _cons |  -.0087706   .0054812    -1.60   0.110    -.0195136    .0019723
------------------------------------------------------------------------------

. mregger, level(90)
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [90% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
       slope |   .6173131   .1034573     5.97   0.000      .447141    .7874853
       _cons |  -.0087706   .0054812    -1.60   0.110    -.0177864    .0002451
------------------------------------------------------------------------------

. 
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, tdist level(90) 

                                                      Number of genotypes = 73
                                              Residual standard error =  1.548
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      t    P>|t|     [90% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
       slope |   .6173131   .1034573     5.97   0.000     .4448912    .7897351
       _cons |  -.0087706   .0054812    -1.60   0.114    -.0179056    .0003643
------------------------------------------------------------------------------

. mregger, level(95)
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
       slope |   .6173131   .1034573     5.97   0.000     .4110251    .8236012
       _cons |  -.0087706   .0054812    -1.60   0.114    -.0196998    .0021585
------------------------------------------------------------------------------

. 
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, tdist ivw

                                                      Number of genotypes = 73
                                              Residual standard error =  1.565
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .4815055   .0597994     8.05   0.000     .3622976    .6007134
------------------------------------------------------------------------------

. mregger, level(90)
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      t    P>|t|     [90% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .4815055   .0597994     8.05   0.000     .3818622    .5811488
------------------------------------------------------------------------------

. 
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, tdist ivw level(90)

                                                      Number of genotypes = 73
                                              Residual standard error =  1.565
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      t    P>|t|     [90% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .4815055   .0597994     8.05   0.000     .3818622    .5811488
------------------------------------------------------------------------------

. mregger, level(95)
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .4815055   .0597994     8.05   0.000     .3622976    .6007134
------------------------------------------------------------------------------

. 
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, tdist ivw fe

                                                      Number of genotypes = 73
                                      Residual standard error constrained at 1
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .4815055    .038221    12.60   0.000     .4053134    .5576976
------------------------------------------------------------------------------

. mregger, level(90)
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      t    P>|t|     [90% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .4815055    .038221    12.60   0.000     .4178181    .5451929
------------------------------------------------------------------------------

. 
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, tdist ivw penw

                                                      Number of genotypes = 73
                                              Residual standard error =  1.000
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .4650819   .0399012    11.66   0.000     .3855403    .5446234
------------------------------------------------------------------------------

. 
. /*
> *** hdlc exposure
> gen byte sel2 = (hdlcp2 < 1e-8)
> mregger chdbeta hdlcbeta [aw=1/(chdse^2)] if sel2==1, re recons reslope
> 
> *** trigs exposure
> gen byte sel3 = (tgp2 < 1e-8)
> mregger chdbeta tgbeta [aw=1/(chdse^2)] if sel3==1, re recons reslope
> */
. 
. *** ivw fe SEs
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, ivw fe

                                                      Number of genotypes = 73
                                      Residual standard error constrained at 1
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .4815055    .038221    12.60   0.000     .4065938    .5564173
------------------------------------------------------------------------------

. 
. *** heterogi option - changed from noheterogi
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, heterogi

                                                      Number of genotypes = 73
                                              Residual standard error =  1.548
                Ruecker's Q for heterogeneity; chi2(71) = 170.11 (p =  0.0000)
                                 I-squared statistic: 0.58 (95% CI 0.46, 0.68)
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
       slope |   .6173131   .1034573     5.97   0.000     .4145405    .8200858
       _cons |  -.0087706   .0054812    -1.60   0.110    -.0195136    .0019723
------------------------------------------------------------------------------

. mregger
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
       slope |   .6173131   .1034573     5.97   0.000     .4145405    .8200858
       _cons |  -.0087706   .0054812    -1.60   0.110    -.0195136    .0019723
------------------------------------------------------------------------------

. 
. discard

. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, het

                                                      Number of genotypes = 73
                                              Residual standard error =  1.548
                Ruecker's Q for heterogeneity; chi2(71) = 170.11 (p =  0.0000)
                                 I-squared statistic: 0.58 (95% CI 0.46, 0.68)
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
       slope |   .6173131   .1034573     5.97   0.000     .4145405    .8200858
       _cons |  -.0087706   .0054812    -1.60   0.110    -.0195136    .0019723
------------------------------------------------------------------------------

. mregger
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
       slope |   .6173131   .1034573     5.97   0.000     .4145405    .8200858
       _cons |  -.0087706   .0054812    -1.60   0.110    -.0195136    .0019723
------------------------------------------------------------------------------

. 
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, ivw heterogi

                                                      Number of genotypes = 73
                                              Residual standard error =  1.565
                Cochran's Q for heterogeneity; chi2(72) = 176.25 (p =  0.0000)
                                 I-squared statistic: 0.59 (95% CI 0.47, 0.68)
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .4815055   .0597994     8.05   0.000     .3643009    .5987101
------------------------------------------------------------------------------

. mregger
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .4815055   .0597994     8.05   0.000     .3643009    .5987101
------------------------------------------------------------------------------

. 
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, ivw het

                                                      Number of genotypes = 73
                                              Residual standard error =  1.565
                Cochran's Q for heterogeneity; chi2(72) = 176.25 (p =  0.0000)
                                 I-squared statistic: 0.59 (95% CI 0.47, 0.68)
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .4815055   .0597994     8.05   0.000     .3643009    .5987101
------------------------------------------------------------------------------

. mregger
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .4815055   .0597994     8.05   0.000     .3643009    .5987101
------------------------------------------------------------------------------

. 
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, heterogi penweighted
Residual variance = .97685468; rerunning with residual variance set to 1

                                                      Number of genotypes = 73
                                              Residual standard error =  0.988
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
       slope |   .5274159   .0681008     7.74   0.000     .3939408    .6608911
       _cons |  -.0050223   .0036849    -1.36   0.173    -.0122446    .0022001
------------------------------------------------------------------------------

. 
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, ivw heterogi penweighte
> d

                                                      Number of genotypes = 73
                                              Residual standard error =  1.000
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .4650819   .0399012    11.66   0.000      .386877    .5432867
------------------------------------------------------------------------------

. 
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1

                                                      Number of genotypes = 73
                                              Residual standard error =  1.548
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
       slope |   .6173131   .1034573     5.97   0.000     .4145405    .8200858
       _cons |  -.0087706   .0054812    -1.60   0.110    -.0195136    .0019723
------------------------------------------------------------------------------

. mregger
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
       slope |   .6173131   .1034573     5.97   0.000     .4145405    .8200858
       _cons |  -.0087706   .0054812    -1.60   0.110    -.0195136    .0019723
------------------------------------------------------------------------------

. 
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, ivw

                                                      Number of genotypes = 73
                                              Residual standard error =  1.565
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .4815055   .0597994     8.05   0.000     .3643009    .5987101
------------------------------------------------------------------------------

. eret list

scalars:
               e(df_r) =  .
                e(phi) =  1.564569469111872
                  e(k) =  73

macros:
            e(cmdline) : "mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1.."
                e(cmd) : "mregger"
         e(properties) : "b V"

matrices:
                  e(b) :  1 x 1
                  e(V) :  1 x 1

. mregger
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .4815055   .0597994     8.05   0.000     .3643009    .5987101
------------------------------------------------------------------------------

. 
. *** check the i^2 and q stats for this example
. cap noi which tsci
c:\ado\personal\t\tsci.ado
*! 1.0.0 Tom Palmer 8jan2010

. if _rc != 0 {
.         net install tsci, from(https://raw.github.com/remlapmot/tsci/master)
. }

. 
. gen double ivests = chdbeta/ldlcbeta if sel1==1
(112 missing values generated)

. gen double se = .
(185 missing values generated)

. local n = _N

. qui forvalues i = 1/`n' {

. replace se = . if sel1==0
(112 real changes made, 112 to missing)

. gen double sefdm = chdse/abs(ldlcbeta) if sel1==1 
(112 missing values generated)

. list se sefdm if sel1==1

     +-----------------------+
     |        se       sefdm |
     |-----------------------|
  1. | .41620703   .41421335 |
  3. | .25490917   .25388702 |
  5. | .30920822   .30800915 |
  6. | .50182747   .49970253 |
  8. | .10896332   .10777225 |
     |-----------------------|
  9. | .77946727   .75891504 |
 10. | .65123353   .65110063 |
 14. | .47081638   .46589113 |
 15. | .60441547   .57803354 |
 18. | .32720374   .32720008 |
     |-----------------------|
 19. | .12866373    .1282934 |
 20. | .13857245   .13769139 |
 23. | .20613456   .20249612 |
 24. | .49622189   .49227703 |
 25. | .63882794   .62885202 |
     |-----------------------|
 26. |  .5282771   .52096301 |
 28. | .57251621   .57065087 |
 31. | .63534627   .63275717 |
 33. | .81148225   .77342728 |
 36. | .53961247   .53181641 |
     |-----------------------|
 42. |  .6747876   .60878681 |
 56. | .19569181   .19431952 |
 57. | .49836398   .49710325 |
 58. | .31941661   .31713217 |
 59. | .47912203   .47894779 |
     |-----------------------|
 60. | .48081609   .47768152 |
 61. | .66578104   .63301225 |
 65. | .54232304   .53255152 |
 69. | .47461549   .46356957 |
 70. | .41631225   .39516211 |
     |-----------------------|
 74. |  .4954845   .49475005 |
 75. | .71267175    .7049174 |
 76. | .54478026   .54305114 |
 77. | .41216395   .40576627 |
 84. | .37355841   .37241555 |
     |-----------------------|
 90. | .52182104   .51904619 |
 91. | .43538972   .43501965 |
 93. | .50069571   .49961178 |
 95. | .58119533   .54903571 |
 96. | .26260854   .25373282 |
     |-----------------------|
 98. | .42055763   .41897469 |
 99. | .59390941   .58010431 |
102. | .57055061   .56641616 |
104. | .44522459   .43501946 |
105. |  .2919475   .27459403 |
     |-----------------------|
110. | .52697302   .52588585 |
113. | .51847418   .48870899 |
118. | .65118315   .65034413 |
119. | .28529493   .28528308 |
122. |  .3943812   .35985138 |
     |-----------------------|
125. | .38022371   .36931131 |
130. | .89866272   .70429776 |
131. | .71121548   .62593135 |
133. | .44088436   .39438585 |
136. | .81812597   .81812597 |
     |-----------------------|
138. | .65987167   .65547617 |
149. | .70195316   .70017926 |
152. | .48524227   .47467397 |
153. | .28687074   .28357557 |
155. | .60713808   .60359458 |
     |-----------------------|
159. | .51730752   .51328701 |
166. | .15971813   .15888854 |
167. |  .2704075   .26080546 |
168. |  .2527411   .24648094 |
171. | .24225166   .24202126 |
     |-----------------------|
172. | .16869525   .16852346 |
173. | .54992353   .54990481 |
176. | .56630617   .56462456 |
177. | .93462319   .93415893 |
179. | .40555349   .40291862 |
     |-----------------------|
180. | .33204247   .32967475 |
181. | .63341594   .62983783 |
184. | .66640616   .66611186 |
     +-----------------------+

. metan ivests se if sel1==1, nograph

Studies included: 73
Participants included: Unknown

Meta-analysis pooling of aggregate data
using the common-effect inverse-variance model

--------------------------------------------------------------------
Study                |   Effect    [95% Conf. Interval]   % Weight
---------------------+----------------------------------------------
1                    |     0.364     -0.452     1.179       0.87
2                    |     0.395     -0.105     0.894       2.31
3                    |    -0.347     -0.953     0.259       1.57
4                    |     0.353     -0.631     1.337       0.60
5                    |     0.588      0.374     0.801      12.66
6                    |     1.120     -0.408     2.648       0.25
7                    |     0.082     -1.195     1.358       0.35
8                    |     0.571     -0.351     1.494       0.68
9                    |    -1.148     -2.333     0.036       0.41
10                   |    -0.016     -0.658     0.625       1.40
11                   |     0.292      0.039     0.544       9.08
12                   |     0.457      0.186     0.729       7.83
13                   |     0.753      0.349     1.157       3.54
14                   |     0.591     -0.382     1.563       0.61
15                   |     0.708     -0.544     1.960       0.37
16                   |     0.653     -0.382     1.688       0.54
17                   |    -0.316     -1.438     0.806       0.46
18                   |    -0.332     -1.577     0.913       0.37
19                   |    -1.417     -3.007     0.174       0.23
20                   |     0.667     -0.391     1.724       0.52
21                   |     1.833      0.511     3.156       0.33
22                   |     0.452      0.069     0.836       3.92
23                   |    -0.268     -1.245     0.709       0.61
24                   |     0.457     -0.170     1.083       1.47
25                   |    -0.115     -1.054     0.824       0.65
26                   |     0.419     -0.523     1.362       0.65
27                   |     1.200     -0.105     2.505       0.34
28                   |     0.731     -0.332     1.794       0.51
29                   |     0.879     -0.051     1.809       0.67
30                   |     1.271      0.455     2.087       0.87
31                   |    -0.218     -1.189     0.753       0.61
32                   |     0.846     -0.551     2.243       0.30
33                   |     0.429     -0.639     1.496       0.51
34                   |     0.694     -0.113     1.502       0.88
35                   |     0.313     -0.419     1.046       1.08
36                   |     0.375     -0.648     1.398       0.55
37                   |    -0.162     -1.015     0.692       0.79
38                   |    -0.255     -1.236     0.727       0.60
39                   |     1.323      0.183     2.462       0.44
40                   |     1.018      0.503     1.533       2.18
41                   |    -0.324     -1.148     0.501       0.85
42                   |     0.778     -0.386     1.942       0.43
43                   |     0.467     -0.652     1.585       0.46
44                   |     0.818     -0.054     1.691       0.76
45                   |     1.463      0.890     2.035       1.76
46                   |    -0.253     -1.286     0.780       0.54
47                   |     1.375      0.359     2.391       0.56
48                   |     0.277     -0.999     1.553       0.35
49                   |     0.036     -0.523     0.595       1.85
50                   |     1.711      0.938     2.483       0.97
51                   |     0.898      0.153     1.644       1.04
52                   |    -3.348     -5.109    -1.586       0.19
53                   |    -1.964     -3.358    -0.570       0.30
54                   |     1.842      0.978     2.706       0.77
55                   |     0.000     -1.603     1.603       0.22
56                   |    -0.600     -1.893     0.693       0.35
57                   |     0.357     -1.019     1.733       0.30
58                   |     0.759     -0.192     1.710       0.64
59                   |     0.615      0.053     1.178       1.83
60                   |     0.417     -0.773     1.607       0.41
61                   |     0.500     -0.514     1.514       0.56
62                   |     0.591      0.278     0.904       5.89
63                   |     1.037      0.507     1.567       2.06
64                   |     0.917      0.421     1.412       2.35
65                   |     0.226     -0.249     0.701       2.56
66                   |     0.286     -0.045     0.616       5.28
67                   |     0.034     -1.043     1.112       0.50
68                   |     0.288     -0.822     1.398       0.47
69                   |    -0.177     -2.008     1.655       0.17
70                   |     0.444     -0.350     1.239       0.91
71                   |     0.452     -0.198     1.103       1.36
72                   |    -0.435     -1.676     0.807       0.37
73                   |    -0.126     -1.432     1.180       0.34
---------------------+----------------------------------------------
Overall, IV          |     0.475      0.399     0.551     100.00
--------------------------------------------------------------------

Test of overall effect = 0:  z =  12.265  p = 0.000


Heterogeneity measures, calculated from the data
with Conf. Intervals based on non-central chi² (common-effect) distribution for
>  Q
---------------------------------------------------------
Measure              |     Value      df      p-value
---------------------+-----------------------------------
Cochran's Q          |    150.95       72      0.000
                     |            -[95% Conf. Interval]-
H                    |     1.448     1.245     1.648
I² (%)               |     52.3%     35.4%     63.2%
---------------------------------------------------------
H = relative excess in Cochran's Q over its degrees-of-freedom
I² = proportion of total variation in effect estimate due to between-study hete
> rogeneity (based on Q)

. metan ivests sefdm if sel1==1, nograph

Studies included: 73
Participants included: Unknown

Meta-analysis pooling of aggregate data
using the common-effect inverse-variance model

--------------------------------------------------------------------
Study                |   Effect    [95% Conf. Interval]   % Weight
---------------------+----------------------------------------------
1                    |     0.364     -0.448     1.175       0.85
2                    |     0.395     -0.103     0.892       2.27
3                    |    -0.347     -0.951     0.257       1.54
4                    |     0.353     -0.626     1.332       0.59
5                    |     0.588      0.376     0.799      12.58
6                    |     1.120     -0.367     2.607       0.25
7                    |     0.082     -1.194     1.358       0.34
8                    |     0.571     -0.342     1.485       0.67
9                    |    -1.148     -2.281    -0.015       0.44
10                   |    -0.016     -0.658     0.625       1.36
11                   |     0.292      0.040     0.543       8.88
12                   |     0.457      0.187     0.727       7.71
13                   |     0.753      0.356     1.150       3.56
14                   |     0.591     -0.374     1.556       0.60
15                   |     0.708     -0.524     1.941       0.37
16                   |     0.653     -0.368     1.674       0.54
17                   |    -0.316     -1.434     0.803       0.45
18                   |    -0.332     -1.572     0.908       0.36
19                   |    -1.417     -2.933     0.099       0.24
20                   |     0.667     -0.376     1.709       0.52
21                   |     1.833      0.640     3.027       0.39
22                   |     0.452      0.071     0.833       3.87
23                   |    -0.268     -1.242     0.706       0.59
24                   |     0.457     -0.165     1.078       1.45
25                   |    -0.115     -1.054     0.824       0.64
26                   |     0.419     -0.517     1.356       0.64
27                   |     1.200     -0.041     2.441       0.36
28                   |     0.731     -0.313     1.775       0.52
29                   |     0.879     -0.030     1.787       0.68
30                   |     1.271      0.496     2.045       0.94
31                   |    -0.218     -1.187     0.752       0.60
32                   |     0.846     -0.535     2.228       0.29
33                   |     0.429     -0.636     1.493       0.50
34                   |     0.694     -0.101     1.490       0.89
35                   |     0.313     -0.416     1.043       1.05
36                   |     0.375     -0.642     1.392       0.54
37                   |    -0.162     -1.014     0.691       0.77
38                   |    -0.255     -1.234     0.724       0.59
39                   |     1.323      0.246     2.399       0.48
40                   |     1.018      0.521     1.515       2.27
41                   |    -0.324     -1.145     0.498       0.83
42                   |     0.778     -0.359     1.915       0.43
43                   |     0.467     -0.643     1.577       0.46
44                   |     0.818     -0.034     1.671       0.77
45                   |     1.463      0.924     2.001       1.94
46                   |    -0.253     -1.284     0.777       0.53
47                   |     1.375      0.417     2.333       0.61
48                   |     0.277     -0.998     1.552       0.35
49                   |     0.036     -0.523     0.595       1.79
50                   |     1.711      1.005     2.416       1.13
51                   |     0.898      0.174     1.622       1.07
52                   |    -3.348     -4.728    -1.967       0.29
53                   |    -1.964     -3.191    -0.737       0.37
54                   |     1.842      1.069     2.615       0.94
55                   |     0.000     -1.603     1.603       0.22
56                   |    -0.600     -1.885     0.685       0.34
57                   |     0.357     -1.015     1.729       0.30
58                   |     0.759     -0.172     1.689       0.65
59                   |     0.615      0.060     1.171       1.82
60                   |     0.417     -0.766     1.600       0.40
61                   |     0.500     -0.506     1.506       0.55
62                   |     0.591      0.279     0.902       5.79
63                   |     1.037      0.526     1.548       2.15
64                   |     0.917      0.434     1.400       2.40
65                   |     0.226     -0.248     0.701       2.49
66                   |     0.286     -0.045     0.616       5.14
67                   |     0.034     -1.043     1.112       0.48
68                   |     0.288     -0.819     1.395       0.46
69                   |    -0.177     -2.008     1.654       0.17
70                   |     0.444     -0.345     1.234       0.90
71                   |     0.452     -0.194     1.099       1.34
72                   |    -0.435     -1.669     0.800       0.37
73                   |    -0.126     -1.432     1.180       0.33
---------------------+----------------------------------------------
Overall, IV          |     0.482      0.407     0.556     100.00
--------------------------------------------------------------------

Test of overall effect = 0:  z =  12.598  p = 0.000


Heterogeneity measures, calculated from the data
with Conf. Intervals based on non-central chi² (common-effect) distribution for
>  Q
---------------------------------------------------------
Measure              |     Value      df      p-value
---------------------+-----------------------------------
Cochran's Q          |    176.25       72      0.000
                     |            -[95% Conf. Interval]-
H                    |     1.565     1.357     1.769
I² (%)               |     59.1%     45.7%     68.0%
---------------------------------------------------------
H = relative excess in Cochran's Q over its degrees-of-freedom
I² = proportion of total variation in effect estimate due to between-study hete
> rogeneity (based on Q)

. 
. metan ivests se if sel1==1, random nograph

Studies included: 73
Participants included: Unknown

Meta-analysis pooling of aggregate data
using the random-effects inverse-variance model
with DerSimonian-Laird estimate of tau²

--------------------------------------------------------------------
Study                |   Effect    [95% Conf. Interval]   % Weight
---------------------+----------------------------------------------
1                    |     0.364     -0.452     1.179       1.43
2                    |     0.395     -0.105     0.894       2.25
3                    |    -0.347     -0.953     0.259       1.94
4                    |     0.353     -0.631     1.337       1.13
5                    |     0.588      0.374     0.801       3.13
6                    |     1.120     -0.408     2.648       0.58
7                    |     0.082     -1.195     1.358       0.78
8                    |     0.571     -0.351     1.494       1.23
9                    |    -1.148     -2.333     0.036       0.87
10                   |    -0.016     -0.658     0.625       1.84
11                   |     0.292      0.039     0.544       3.03
12                   |     0.457      0.186     0.729       2.97
13                   |     0.753      0.349     1.157       2.56
14                   |     0.591     -0.382     1.563       1.15
15                   |     0.708     -0.544     1.960       0.80
16                   |     0.653     -0.382     1.688       1.06
17                   |    -0.316     -1.438     0.806       0.94
18                   |    -0.332     -1.577     0.913       0.81
19                   |    -1.417     -3.007     0.174       0.55
20                   |     0.667     -0.391     1.724       1.03
21                   |     1.833      0.511     3.156       0.74
22                   |     0.452      0.069     0.836       2.62
23                   |    -0.268     -1.245     0.709       1.15
24                   |     0.457     -0.170     1.083       1.89
25                   |    -0.115     -1.054     0.824       1.21
26                   |     0.419     -0.523     1.362       1.20
27                   |     1.200     -0.105     2.505       0.75
28                   |     0.731     -0.332     1.794       1.02
29                   |     0.879     -0.051     1.809       1.22
30                   |     1.271      0.455     2.087       1.43
31                   |    -0.218     -1.189     0.753       1.15
32                   |     0.846     -0.551     2.243       0.68
33                   |     0.429     -0.639     1.496       1.01
34                   |     0.694     -0.113     1.502       1.45
35                   |     0.313     -0.419     1.046       1.62
36                   |     0.375     -0.648     1.398       1.08
37                   |    -0.162     -1.015     0.692       1.36
38                   |    -0.255     -1.236     0.727       1.14
39                   |     1.323      0.183     2.462       0.92
40                   |     1.018      0.503     1.533       2.21
41                   |    -0.324     -1.148     0.501       1.42
42                   |     0.778     -0.386     1.942       0.89
43                   |     0.467     -0.652     1.585       0.95
44                   |     0.818     -0.054     1.691       1.32
45                   |     1.463      0.890     2.035       2.04
46                   |    -0.253     -1.286     0.780       1.06
47                   |     1.375      0.359     2.391       1.09
48                   |     0.277     -0.999     1.553       0.78
49                   |     0.036     -0.523     0.595       2.07
50                   |     1.711      0.938     2.483       1.52
51                   |     0.898      0.153     1.644       1.59
52                   |    -3.348     -5.109    -1.586       0.46
53                   |    -1.964     -3.358    -0.570       0.68
54                   |     1.842      0.978     2.706       1.34
55                   |     0.000     -1.603     1.603       0.54
56                   |    -0.600     -1.893     0.693       0.76
57                   |     0.357     -1.019     1.733       0.69
58                   |     0.759     -0.192     1.710       1.19
59                   |     0.615      0.053     1.178       2.07
60                   |     0.417     -0.773     1.607       0.87
61                   |     0.500     -0.514     1.514       1.09
62                   |     0.591      0.278     0.904       2.85
63                   |     1.037      0.507     1.567       2.16
64                   |     0.917      0.421     1.412       2.27
65                   |     0.226     -0.249     0.701       2.33
66                   |     0.286     -0.045     0.616       2.79
67                   |     0.034     -1.043     1.112       1.00
68                   |     0.288     -0.822     1.398       0.96
69                   |    -0.177     -2.008     1.655       0.43
70                   |     0.444     -0.350     1.239       1.48
71                   |     0.452     -0.198     1.103       1.82
72                   |    -0.435     -1.676     0.807       0.81
73                   |    -0.126     -1.432     1.180       0.75
---------------------+----------------------------------------------
Overall, DL          |     0.438      0.310     0.566     100.00
--------------------------------------------------------------------

Test of overall effect = 0:  z =   6.706  p = 0.000


Heterogeneity measures, calculated from the data
with Conf. Intervals based on Gamma (random-effects) distribution for Q
---------------------------------------------------------
Measure              |     Value      df      p-value
---------------------+-----------------------------------
Cochran's Q          |    150.95       72      0.000
                     |            -[95% Conf. Interval]-
H                    |     1.448     1.150     1.745
I² (%)               |     52.3%     24.4%     67.2%
---------------------------------------------------------
H = relative excess in Cochran's Q over its degrees-of-freedom
I² = proportion of total variation in effect estimate due to between-study hete
> rogeneity (based on Q)


Heterogeneity variance estimates
-----------------------------------
Method               |     tau²
---------------------+-------------
DL                   |    0.1243
-----------------------------------

. metan ivests se if sel1==1, randomi nograph

Studies included: 73
Participants included: Unknown

Meta-analysis pooling of aggregate data
using the random-effects inverse-variance model
with DerSimonian-Laird estimate of tau²

--------------------------------------------------------------------
Study                |   Effect    [95% Conf. Interval]   % Weight
---------------------+----------------------------------------------
1                    |     0.364     -0.452     1.179       1.43
2                    |     0.395     -0.105     0.894       2.25
3                    |    -0.347     -0.953     0.259       1.94
4                    |     0.353     -0.631     1.337       1.13
5                    |     0.588      0.374     0.801       3.13
6                    |     1.120     -0.408     2.648       0.58
7                    |     0.082     -1.195     1.358       0.78
8                    |     0.571     -0.351     1.494       1.23
9                    |    -1.148     -2.333     0.036       0.87
10                   |    -0.016     -0.658     0.625       1.84
11                   |     0.292      0.039     0.544       3.03
12                   |     0.457      0.186     0.729       2.97
13                   |     0.753      0.349     1.157       2.56
14                   |     0.591     -0.382     1.563       1.15
15                   |     0.708     -0.544     1.960       0.80
16                   |     0.653     -0.382     1.688       1.06
17                   |    -0.316     -1.438     0.806       0.94
18                   |    -0.332     -1.577     0.913       0.81
19                   |    -1.417     -3.007     0.174       0.55
20                   |     0.667     -0.391     1.724       1.03
21                   |     1.833      0.511     3.156       0.74
22                   |     0.452      0.069     0.836       2.62
23                   |    -0.268     -1.245     0.709       1.15
24                   |     0.457     -0.170     1.083       1.89
25                   |    -0.115     -1.054     0.824       1.21
26                   |     0.419     -0.523     1.362       1.20
27                   |     1.200     -0.105     2.505       0.75
28                   |     0.731     -0.332     1.794       1.02
29                   |     0.879     -0.051     1.809       1.22
30                   |     1.271      0.455     2.087       1.43
31                   |    -0.218     -1.189     0.753       1.15
32                   |     0.846     -0.551     2.243       0.68
33                   |     0.429     -0.639     1.496       1.01
34                   |     0.694     -0.113     1.502       1.45
35                   |     0.313     -0.419     1.046       1.62
36                   |     0.375     -0.648     1.398       1.08
37                   |    -0.162     -1.015     0.692       1.36
38                   |    -0.255     -1.236     0.727       1.14
39                   |     1.323      0.183     2.462       0.92
40                   |     1.018      0.503     1.533       2.21
41                   |    -0.324     -1.148     0.501       1.42
42                   |     0.778     -0.386     1.942       0.89
43                   |     0.467     -0.652     1.585       0.95
44                   |     0.818     -0.054     1.691       1.32
45                   |     1.463      0.890     2.035       2.04
46                   |    -0.253     -1.286     0.780       1.06
47                   |     1.375      0.359     2.391       1.09
48                   |     0.277     -0.999     1.553       0.78
49                   |     0.036     -0.523     0.595       2.07
50                   |     1.711      0.938     2.483       1.52
51                   |     0.898      0.153     1.644       1.59
52                   |    -3.348     -5.109    -1.586       0.46
53                   |    -1.964     -3.358    -0.570       0.68
54                   |     1.842      0.978     2.706       1.34
55                   |     0.000     -1.603     1.603       0.54
56                   |    -0.600     -1.893     0.693       0.76
57                   |     0.357     -1.019     1.733       0.69
58                   |     0.759     -0.192     1.710       1.19
59                   |     0.615      0.053     1.178       2.07
60                   |     0.417     -0.773     1.607       0.87
61                   |     0.500     -0.514     1.514       1.09
62                   |     0.591      0.278     0.904       2.85
63                   |     1.037      0.507     1.567       2.16
64                   |     0.917      0.421     1.412       2.27
65                   |     0.226     -0.249     0.701       2.33
66                   |     0.286     -0.045     0.616       2.79
67                   |     0.034     -1.043     1.112       1.00
68                   |     0.288     -0.822     1.398       0.96
69                   |    -0.177     -2.008     1.655       0.43
70                   |     0.444     -0.350     1.239       1.48
71                   |     0.452     -0.198     1.103       1.82
72                   |    -0.435     -1.676     0.807       0.81
73                   |    -0.126     -1.432     1.180       0.75
---------------------+----------------------------------------------
Overall, DL          |     0.438      0.310     0.566     100.00
--------------------------------------------------------------------

Test of overall effect = 0:  z =   6.706  p = 0.000


Heterogeneity measures, calculated from the data
with Conf. Intervals based on Gamma (random-effects) distribution for Q
---------------------------------------------------------
Measure              |     Value      df      p-value
---------------------+-----------------------------------
Cochran's Q          |    150.95       72      0.000
                     |            -[95% Conf. Interval]-
H                    |     1.448     1.150     1.745
I² (%)               |     52.3%     24.4%     67.2%
---------------------------------------------------------
H = relative excess in Cochran's Q over its degrees-of-freedom
I² = proportion of total variation in effect estimate due to between-study hete
> rogeneity (based on Q)


Heterogeneity variance estimates
-----------------------------------
Method               |     tau²
---------------------+-------------
DL                   |    0.1243
-----------------------------------

. 
. ** norescale
. mregger chdbeta ldlcbeta [aw=1/chdse^2] if sel1==1, ivw

                                                      Number of genotypes = 73
                                              Residual standard error =  1.565
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .4815055   .0597994     8.05   0.000     .3643009    .5987101
------------------------------------------------------------------------------

. mregger chdbeta ldlcbeta [aw=1/chdse^2] if sel1==1, ivw norescale

                                                      Number of genotypes = 73
                                              Residual standard error =  1.565
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .4815055   .0597994     8.05   0.000     .3643009    .5987101
------------------------------------------------------------------------------

. 
. mregger chdbeta ldlcbeta [aw=1/chdse^2] if sel1==1

                                                      Number of genotypes = 73
                                              Residual standard error =  1.548
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
       slope |   .6173131   .1034573     5.97   0.000     .4145405    .8200858
       _cons |  -.0087706   .0054812    -1.60   0.110    -.0195136    .0019723
------------------------------------------------------------------------------

. mregger chdbeta ldlcbeta [aw=1/chdse^2] if sel1==1, norescale

                                                      Number of genotypes = 73
                                              Residual standard error =  1.548
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
       slope |   .6173131   .1034573     5.97   0.000     .4145405    .8200858
       _cons |  -.0087706   .0054812    -1.60   0.110    -.0195136    .0019723
------------------------------------------------------------------------------

. 
. gen double chdbeta2 = chdbeta/100

. mregger chdbeta2 ldlcbeta [aw=1/chdse^2] if sel1==1, ivw
Residual variance = .00024479; rerunning with residual variance set to 1

                                                      Number of genotypes = 73
                                              Residual standard error =  1.000
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta2     |
    ldlcbeta |   .0048151    .038221     0.13   0.900    -.0700967    .0797268
------------------------------------------------------------------------------

. mregger chdbeta2 ldlcbeta [aw=1/chdse^2] if sel1==1, ivw norescale
Residual variance = .00024479; recommend refitting without norescale option

                                                      Number of genotypes = 73
                                              Residual standard error =  0.016
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta2     |
    ldlcbeta |   .0048151    .000598     8.05   0.000      .003643    .0059871
------------------------------------------------------------------------------

. mregger chdbeta2 ldlcbeta [aw=1/chdse^2] if sel1==1
Residual variance = .0002396; rerunning with residual variance set to 1

                                                      Number of genotypes = 73
                                              Residual standard error =  0.015
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta2     |
       slope |   .0061731   .0668378     0.09   0.926    -.1248266    .1371729
       _cons |  -.0000877   .0035411    -0.02   0.980    -.0070281    .0068527
------------------------------------------------------------------------------

. mregger chdbeta2 ldlcbeta [aw=1/chdse^2] if sel1==1, norescale
Residual variance = .0002396; recommend refitting without norescale option

                                                      Number of genotypes = 73
                                              Residual standard error =  0.015
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta2     |
       slope |   .0061731   .0010346     5.97   0.000     .0041454    .0082009
       _cons |  -.0000877   .0000548    -1.60   0.110    -.0001951    .0000197
------------------------------------------------------------------------------

. 
. ** penweighted
. mregger chdbeta ldlcbeta [aw=1/chdse^2] if sel1==1, ivw penweighted

                                                      Number of genotypes = 73
                                              Residual standard error =  1.000
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .4650819   .0399012    11.66   0.000      .386877    .5432867
------------------------------------------------------------------------------

. mregger chdbeta ldlcbeta [aw=1/chdse^2] if sel1==1, penweighted
Residual variance = .97685468; rerunning with residual variance set to 1

                                                      Number of genotypes = 73
                                              Residual standard error =  0.988
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
       slope |   .5274159   .0681008     7.74   0.000     .3939408    .6608911
       _cons |  -.0050223   .0036849    -1.36   0.173    -.0122446    .0022001
------------------------------------------------------------------------------

. 
. ** penweighted norescale
. mregger chdbeta2 ldlcbeta [aw=1/chdse^2] if sel1==1, ivw penweighted
Residual variance = .00024479; rerunning with residual variance set to 1

                                                      Number of genotypes = 73
                                              Residual standard error =  1.000
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta2     |
    ldlcbeta |   .0048151    .038221     0.13   0.900    -.0700967    .0797268
------------------------------------------------------------------------------

. mregger chdbeta2 ldlcbeta [aw=1/chdse^2] if sel1==1, ivw penweighted norescal
> e
Residual variance = .00024479; recommend refitting without norescale option

                                                      Number of genotypes = 73
                                              Residual standard error =  0.016
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta2     |
    ldlcbeta |   .0048151    .000598     8.05   0.000      .003643    .0059871
------------------------------------------------------------------------------

. mregger chdbeta2 ldlcbeta [aw=1/chdse^2] if sel1==1, penweighted
Residual variance = .0002396; rerunning with residual variance set to 1

                                                      Number of genotypes = 73
                                              Residual standard error =  0.015
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta2     |
       slope |   .0061731   .0668378     0.09   0.926    -.1248266    .1371729
       _cons |  -.0000877   .0035411    -0.02   0.980    -.0070281    .0068527
------------------------------------------------------------------------------

. mregger chdbeta2 ldlcbeta [aw=1/chdse^2] if sel1==1, penweighted norescale
Residual variance = .0002396; recommend refitting without norescale option

                                                      Number of genotypes = 73
                                              Residual standard error =  0.015
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta2     |
       slope |   .0061731   .0010346     5.97   0.000     .0041454    .0082009
       _cons |  -.0000877   .0000548    -1.60   0.110    -.0001951    .0000197
------------------------------------------------------------------------------

. 
. ** gxse
. mregger chdbeta ldlcbeta [aw=1/chdse^2] if sel1==1, gxse(ldlcse)

                                           Q_GX statistic (weighted) = 3454.26
                                         I^2_GX statistic (weighted) =  97.92%
                                                      Number of genotypes = 73
                                              Residual standard error =  1.548
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
       slope |   .6173131   .1034573     5.97   0.000     .4145405    .8200858
       _cons |  -.0087706   .0054812    -1.60   0.110    -.0195136    .0019723
------------------------------------------------------------------------------

. mregger chdbeta ldlcbeta [aw=1/chdse^2] if sel1==1, gxse(ldlcse) ivw

                                                      Number of genotypes = 73
                                              Residual standard error =  1.565
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .4815055   .0597994     8.05   0.000     .3643009    .5987101
------------------------------------------------------------------------------

. * mregger chdbeta ldlcbeta [aw=1/chdse^2] if sel1==1, gxse(ldlcse) penweighte
> d // TODO bugfix
. mregger chdbeta ldlcbeta [aw=1/chdse^2] if sel1==1, gxse(ldlcse) ///
>         ivw penweighted

                                                      Number of genotypes = 73
                                              Residual standard error =  1.000
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .4650819   .0399012    11.66   0.000      .386877    .5432867
------------------------------------------------------------------------------

. 
. * testing less than 3 observations error message        
. rcof "mregger chdbeta ldlcbeta [aw=1/(chdse^2)] in 1/2" == 2001 

. rcof "mregger chdbeta ldlcbeta [aw=1/(chdse^2)] in 1" == 2001 

. 
. // radial IVW
. mregger chdbeta ldlcbeta [aw=1/chdse^2] if sel1==1, ivw radial

                                                      Number of genotypes = 73
                                              Residual standard error =  1.565
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
radialGD     |
    radialGP |   .4815055   .0597994     8.05   0.000     .3643009    .5987101
------------------------------------------------------------------------------

. assert abs(_b[radialGP] - .482) < 1e-3

. assert abs(_se[radialGP] - 0.059) < 1e-3

. 
. // radial IVW fe SEs
. mregger chdbeta ldlcbeta [aw=1/chdse^2] if sel1==1, ivw radial fe

                                                      Number of genotypes = 73
                                      Residual standard error constrained at 1
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
radialGD     |
    radialGP |   .4815055    .038221    12.60   0.000     .4065938    .5564173
------------------------------------------------------------------------------

. assert abs(_b[radialGP] - .482) < 1e-3

. assert abs(_se[radialGP] - .038) < 1e-3

. eret list

scalars:
               e(df_r) =  .
                e(phi) =  1
                  e(k) =  73

macros:
            e(cmdline) : "mregger chdbeta ldlcbeta [aw=1/chdse^2] if sel1==.."
                e(cmd) : "mregger"
         e(properties) : "b V"

matrices:
                  e(b) :  1 x 1
                  e(V) :  1 x 1

. 
. // radial IVW re
. /*
> mregger chdbeta ldlcbeta [aw=1/chdse^2] if sel1==1, ivw radial re
> //assert abs(_b[radialGP] - .417) < 1e-3
> //assert abs(_se[radialGP] - .076) < 1e-3
> eret list
> */
. 
. // radial MR-Egger
. mregger chdbeta ldlcbeta [aw=1/chdse^2] if sel1==1, radial

                                                      Number of genotypes = 73
                                              Residual standard error =  1.547
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
radialGD     |
    radialGP |    .642582   .1157871     5.55   0.000     .4156434    .8695205
       _cons |  -.5737301   .3545658    -1.62   0.106    -1.268666    .1212062
------------------------------------------------------------------------------

. assert abs(_b[radialGP] - .642) < 1e-3

. assert abs(_se[radialGP] - .115) < 1e-3

. assert abs(_b[_cons] - -.573) < 1e-3

. assert abs(_se[_cons] - .354) < 1e-3

. 
. // radial MR-Egger fe
. mregger chdbeta ldlcbeta [aw=1/chdse^2] if sel1==1, radial fe

                                                      Number of genotypes = 73
                                      Residual standard error constrained at 1
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
radialGD     |
    radialGP |    .642582   .0748328     8.59   0.000     .4959124    .7892515
       _cons |  -.5737301   .2291547    -2.50   0.012    -1.022865   -.1245952
------------------------------------------------------------------------------

. assert abs(_b[radialGP] - .642) < 1e-3

. assert abs(_se[radialGP] - .074) < 1e-3

. assert abs(_b[_cons] - -.573) < 1e-3

. assert abs(_se[_cons] - .229) < 1e-3

. 
. // radial MR-Egger re
. /*
> mregger chdbeta ldlcbeta [aw=1/chdse^2] if sel1==1, radial re
> assert abs(_b[radialGP] - .623) < 1e-3
> assert abs(_se[radialGP] - .106) < 1e-3
> assert abs(_b[_cons] - -.523) < 1e-3
> assert abs(_se[_cons] - .342) < 1e-3
> */
. 
. // disallow penweighted and radial for now
. rcof "noi mregger chdbeta ldlcbeta [aw=1/chdse^2] if sel1==1, radial penweigh
> ted" ///
>         == 198
Options radial and penweighted currently not supported.

. 
. // mregger with radial formulation and tdist
. mregger chdbeta ldlcbeta [aw=1/chdse^2] if sel1==1, radial tdist

                                                      Number of genotypes = 73
                                              Residual standard error =  1.547
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
radialGD     |
    radialGP |    .642582   .1157871     5.55   0.000     .4117091    .8734549
       _cons |  -.5737301   .3545658    -1.62   0.110    -1.280714    .1332541
------------------------------------------------------------------------------

. assert abs(_b[radialGP] - .642) < 1e-3

. assert abs(_se[radialGP] - .115) < 1e-3

. assert abs(_b[_cons] - -.573) < 1e-3

. assert abs(_se[_cons] - .354) < 1e-3

. 
. // radial and heterogi
. mregger chdbeta ldlcbeta [aw=1/chdse^2] if sel1==1, radial heterogi

                                                      Number of genotypes = 73
                                              Residual standard error =  1.547
                Ruecker's Q for heterogeneity; chi2(71) = 169.98 (p =  0.0000)
                                 I-squared statistic: 0.58 (95% CI 0.46, 0.68)
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
radialGD     |
    radialGP |    .642582   .1157871     5.55   0.000     .4156434    .8695205
       _cons |  -.5737301   .3545658    -1.62   0.106    -1.268666    .1212062
------------------------------------------------------------------------------

. assert abs(e(Q) - 169.97) < 1e-2

. 
. // radial and i2gx
. mregger chdbeta ldlcbeta [aw=1/chdse^2] if sel1==1, radial gxse(ldlcse)

                                           Q_GX statistic (weighted) = 3454.26
                                         I^2_GX statistic (weighted) =  97.92%
                                                      Number of genotypes = 73
                                              Residual standard error =  1.547
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
radialGD     |
    radialGP |    .642582   .1157871     5.55   0.000     .4156434    .8695205
       _cons |  -.5737301   .3545658    -1.62   0.106    -1.268666    .1212062
------------------------------------------------------------------------------

. //assert abs(e(Q) - 169.97) < 1e-2
. 
. // oldnames
. discard

. mregger chdbeta ldlcbeta [aw=1/chdse^2] if sel1==1

                                                      Number of genotypes = 73
                                              Residual standard error =  1.548
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
       slope |   .6173131   .1034573     5.97   0.000     .4145405    .8200858
       _cons |  -.0087706   .0054812    -1.60   0.110    -.0195136    .0019723
------------------------------------------------------------------------------

. mregger chdbeta ldlcbeta [aw=1/chdse^2] if sel1==1, oldnames

                                                      Number of genotypes = 73
                                              Residual standard error =  1.548
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
sign(ldlcb~a)|
chdbeta      |
       slope |   .6173131   .1034573     5.97   0.000     .4145405    .8200858
       _cons |  -.0087706   .0054812    -1.60   0.110    -.0195136    .0019723
------------------------------------------------------------------------------

. mregger chdbeta ldlcbeta [aw=1/chdse^2] if sel1==1, ivw

                                                      Number of genotypes = 73
                                              Residual standard error =  1.565
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .4815055   .0597994     8.05   0.000     .3643009    .5987101
------------------------------------------------------------------------------

. mregger chdbeta ldlcbeta [aw=1/chdse^2] if sel1==1, ivw oldnames

                                                      Number of genotypes = 73
                                              Residual standard error =  1.565
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .4815055   .0597994     8.05   0.000     .3643009    .5987101
------------------------------------------------------------------------------

. 
. qui mregger chdbeta ldlcbeta [aw=1/chdse^2] if sel1==1, radial heterogi gxse(
> ldlcse)

. mregger
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
radialGD     |
    radialGP |    .642582   .1157871     5.55   0.000     .4156434    .8695205
       _cons |  -.5737301   .3545658    -1.62   0.106    -1.268666    .1212062
------------------------------------------------------------------------------

. 
. // ivw e(phi)
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, ivw

                                                      Number of genotypes = 73
                                              Residual standard error =  1.565
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .4815055   .0597994     8.05   0.000     .3643009    .5987101
------------------------------------------------------------------------------

. assert e(k) == 73

. assert e(phi) - 1.565 < 1e-3

. 
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, ivw fe

                                                      Number of genotypes = 73
                                      Residual standard error constrained at 1
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
    ldlcbeta |   .4815055    .038221    12.60   0.000     .4065938    .5564173
------------------------------------------------------------------------------

. assert e(phi) == 1

. 
. // mregger e(phi)
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1

                                                      Number of genotypes = 73
                                              Residual standard error =  1.548
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
       slope |   .6173131   .1034573     5.97   0.000     .4145405    .8200858
       _cons |  -.0087706   .0054812    -1.60   0.110    -.0195136    .0019723
------------------------------------------------------------------------------

. assert e(phi) - 1.548 < 1e-3

. 
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, fe

                                                      Number of genotypes = 73
                                      Residual standard error constrained at 1
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
chdbeta      |
       slope |   .6173131   .0668378     9.24   0.000     .4863134    .7483129
       _cons |  -.0087706   .0035411    -2.48   0.013     -.015711   -.0018303
------------------------------------------------------------------------------

. assert e(phi) == 1

. 
end of do-file
      name:  mregger
       log:  C:\Users\eptmp\Documents\GitHub\mrrobust\cscripts\mregger.log
  log type:  text
 closed on:  26 Apr 2021, 11:36:42
-------------------------------------------------------------------------------
