-------------------------------------------------------------------------------
      name:  mreggersimex
       log:  /Users/eptmp/Documents/GitHub/mrrobust/cscripts/mreggersimex.log
  log type:  text
 opened on:  25 Jul 2024, 09:14:50

. * cscript for mreggersimex
. * 23jul2017
. 
. cscript mreggersimex adofiles mreggersimex mreggersimexonce
-------------------------------------------------------------BEGIN mreggersimex

-> which mreggersimex, usesysdir
/Users/eptmp/Documents/GitHub/mrrobust/mreggersimex.ado
*! 0.1.0 20jul2017 Tom Palmer

-> which mreggersimexonce, usesysdir
/Users/eptmp/Documents/GitHub/mrrobust/mreggersimexonce.ado
*! 0.1.0 23jul2017 Tom Palmer

. 
. about

StataNow/MP 18.5 for Mac (Apple Silicon)
Revision 16 Jul 2024
Copyright 1985-2023 StataCorp LLC

Total physical memory: 18.00 GB

Stata license: Unlimited-user 2-core network, expiring 29 Jan 2025
Serial number: 501809305331
  Licensed to: Tom Palmer
               University of Bristol

. 
. use https://raw.github.com/remlapmot/mrrobust/master/dodata, clear

. 
. gen byte sel1 = (ldlcp2 < 1e-8)

. 
. mreggersimex chdbeta ldlcbeta [aw=1/chdse^2] if sel1==1, ///
>         gxse(ldlcse) seed(12345)
(running mreggersimexonce on estimation sample)

Bootstrap replications (25): .........10.........20..... done

                                                      Number of genotypes = 73
                                                   Bootstrap replications = 25
                                                  Simulation replications = 50
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       slope |   .6256194    .116624     5.36   0.000     .3970405    .8541982
       _cons |  -.0089987   .0062257    -1.45   0.148    -.0212008    .0032035
------------------------------------------------------------------------------

. mat li r(table)

r(table)[9,2]
             slope       _cons
     b   .62561937  -.00899868
    se   .11662401   .00622569
     z   5.3644133    -1.44541
pvalue   8.121e-08   .14834275
    ll   .39704052  -.02120082
    ul   .85419822   .00320346
    df           .           .
  crit    1.959964    1.959964
 eform           0           0

. 
. mreggersimex chdbeta ldlcbeta [aw=1/chdse^2] if sel1==1, ///
>         gxse(ldlcse) seed(12345) simreps(20) reps(3)
(running mreggersimexonce on estimation sample)

Bootstrap replications (3): ... done

                                                      Number of genotypes = 73
                                                    Bootstrap replications = 3
                                                  Simulation replications = 20
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       slope |   .6396257   .0485306    13.18   0.000     .5445074     .734744
       _cons |   -.009941   .0061239    -1.62   0.105    -.0219436    .0020616
------------------------------------------------------------------------------

. 
. mreggersimex chdbeta ldlcbeta [aw=1/chdse^2] if sel1==1, ///
>         gxse(ldlcse) seed(12345) simreps(10)
(running mreggersimexonce on estimation sample)

Bootstrap replications (25): .........10.........20..... done

                                                      Number of genotypes = 73
                                                   Bootstrap replications = 25
                                                  Simulation replications = 10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       slope |   .6047862   .1314017     4.60   0.000     .3472436    .8623287
       _cons |  -.0079552   .0053891    -1.48   0.140    -.0185177    .0026073
------------------------------------------------------------------------------

. 
. mreggersimex chdbeta ldlcbeta [aw=1/chdse^2] if sel1==1, ///
>         gxse(ldlcse) seed(12345) simreps(10) nodraw noboot

                                                      Number of genotypes = 73
                                                    Bootstrap replications = 0
                                                  Simulation replications = 10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       slope |   .6047862          .        .       .            .           .
       _cons |  -.0079552          .        .       .            .           .
------------------------------------------------------------------------------

. mreggersimex

                                                      Number of genotypes = 73
                                                    Bootstrap replications = 0
                                                  Simulation replications = 10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       slope |   .6047862          .        .       .            .           .
       _cons |  -.0079552          .        .       .            .           .
------------------------------------------------------------------------------

. mat li r(table)

r(table)[9,2]
             slope       _cons
     b   .60478616  -.00795516
    se           .           .
     z           .           .
pvalue           .           .
    ll           .           .
    ul           .           .
    df           .           .
  crit    1.959964    1.959964
 eform           0           0

. 
. mreggersimex chdbeta ldlcbeta [aw=1/chdse^2] if sel1==1, ///
>         gxse(ldlcse) seed(12345) simreps(10) nodraw
(running mreggersimexonce on estimation sample)

Bootstrap replications (25): .........10.........20..... done

                                                      Number of genotypes = 73
                                                   Bootstrap replications = 25
                                                  Simulation replications = 10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       slope |   .6047862   .1314017     4.60   0.000     .3472436    .8623287
       _cons |  -.0079552   .0053891    -1.48   0.140    -.0185177    .0026073
------------------------------------------------------------------------------

. mat li r(table)

r(table)[9,2]
             slope       _cons
     b   .60478616  -.00795516
    se   .13140166   .00538913
     z   4.6025762  -1.4761482
pvalue   4.173e-06   .13990412
    ll   .34724364  -.01851767
    ul   .86232869   .00260735
    df           .           .
  crit    1.959964    1.959964
 eform           0           0

. 
end of do-file
      name:  mreggersimex
       log:  /Users/eptmp/Documents/GitHub/mrrobust/cscripts/mreggersimex.log
  log type:  text
 closed on:  25 Jul 2024, 09:17:57
-------------------------------------------------------------------------------
