-------------------------------------------------------------------------------
      name:  mrmedianobs
       log:  C:\Users\eptmp\Documents\GitHub\mrrobust\cscripts\mrmedianobs.log
  log type:  text
 opened on:  25 Jun 2021, 10:34:57

. * mrmedianobs cscript
. * 4jun2016
. 
. cscript mrmedianobs adofiles mrmedianobs mrmedianobs_work
--------------------------------------------------------------BEGIN mrmedianobs

-> which mrmedianobs, usesysdir
C:\Users\eptmp\Documents\GitHub\mrrobust\mrmedianobs.ado
*! version 0.1.0 04jun2016 Tom Palmer

-> which mrmedianobs_work, usesysdir
C:\Users\eptmp\Documents\GitHub\mrrobust\mrmedianobs_work.ado
*! version 0.1.0 04jun2016 Tom Palmer

. 
. ** simulate data
. set seed 12345

. 
. set obs 1000
number of observations (_N) was 0, now 1,000

. local zformula

. forvalues i=1/20 {
  2.         gen int z`i' = rbinomial(2,`=runiform()')
  3. }

. egen double x = rowtotal(z*)

. replace x = x + rnormal()
(1,000 real changes made)

. gen double y = x + rnormal()

. 
. *** test replay
. mrmedianobs y (x = z*)

                                                      Number of genotypes = 20
                                                          Number of obs = 1000
                                                             Replications = 50
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .9986435   .0638845    15.63   0.000     .8734322    1.123855
------------------------------------------------------------------------------

. mrmedianobs

                                                      Number of genotypes = 20
                                                          Number of obs = 1000
                                                             Replications = 50
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .9986435   .0638845    15.63   0.000     .8734322    1.123855
------------------------------------------------------------------------------

. 
. *** test seed
. mrmedianobs y (x = z*), seed(3456)

                                                      Number of genotypes = 20
                                                          Number of obs = 1000
                                                             Replications = 50
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .9986435   .0698186    14.30   0.000     .8618015    1.135485
------------------------------------------------------------------------------

. scalar b1 = _b[beta]

. scalar s1 = _se[beta]

. mrmedianobs y (x = z*), seed(3456)

                                                      Number of genotypes = 20
                                                          Number of obs = 1000
                                                             Replications = 50
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .9986435   .0698186    14.30   0.000     .8618015    1.135485
------------------------------------------------------------------------------

. assert abs(_b[beta] - scalar(b1)) < 1e-7

. assert abs(_se[beta] - scalar(s1)) < 1e-7

. 
. *** test reps()
. mrmedianobs y (x = z*), obsboot reps(10) seed(12345)
(running mrmedianobs_work on estimation sample)

Bootstrap replications (10)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..........

                                                      Number of genotypes = 20
                                                          Number of obs = 1000
                                                             Replications = 10
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .9986435   .0149929    66.61   0.000      .969258    1.028029
------------------------------------------------------------------------------

. scalar b2 = _b[beta]

. scalar s2 = _se[beta]

. 
. mrmedianobs y (x = z*), obsboot reps(10) seed(12345)
(running mrmedianobs_work on estimation sample)

Bootstrap replications (10)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..........

                                                      Number of genotypes = 20
                                                          Number of obs = 1000
                                                             Replications = 10
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .9986435   .0149929    66.61   0.000      .969258    1.028029
------------------------------------------------------------------------------

. assert abs(_b[beta] - scalar(b2)) < 1e-7

. assert abs(_se[beta] - scalar(s2)) < 1e-7

. mat list r(table)

r(table)[9,1]
             beta
     b  .99864349
    se  .01499286
     z  66.607959
pvalue          0
    ll  .96925803
    ul  1.0280289
    df          .
  crit   1.959964
 eform          0

. 
. mrmedianobs

                                                      Number of genotypes = 20
                                                          Number of obs = 1000
                                                             Replications = 10
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .9986435   .0149929    66.61   0.000      .969258    1.028029
------------------------------------------------------------------------------

. 
. *** test weights
. mrmedianobs y (x = z*), reps(10) seed(12345) weighted

                                                      Number of genotypes = 20
                                                          Number of obs = 1000
                                                             Replications = 10
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .9987268   .0901623    11.08   0.000      .822012    1.175442
------------------------------------------------------------------------------

. mat list r(table)

r(table)[9,1]
             beta
     b   .9987268
    se  .09016228
     z  11.076992
pvalue  1.622e-28
    ll  .82201199
    ul  1.1754416
    df          .
  crit   1.959964
 eform          0

. 
. mrmedianobs y (x = z*), reps(10) seed(12345) penweighted

                                                      Number of genotypes = 20
                                                          Number of obs = 1000
                                                             Replications = 10
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .9987268   .0901623    11.08   0.000      .822012    1.175442
------------------------------------------------------------------------------

. mat list r(table)

r(table)[9,1]
             beta
     b   .9987268
    se  .09016228
     z  11.076992
pvalue  1.622e-28
    ll  .82201199
    ul  1.1754416
    df          .
  crit   1.959964
 eform          0

. 
. *** test obsboot and weights
. mrmedianobs y (x = z*), obsboot reps(10) seed(12345)
(running mrmedianobs_work on estimation sample)

Bootstrap replications (10)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..........

                                                      Number of genotypes = 20
                                                          Number of obs = 1000
                                                             Replications = 10
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .9986435   .0149929    66.61   0.000      .969258    1.028029
------------------------------------------------------------------------------

. 
. mrmedianobs y (x = z*), obsboot reps(10) seed(12345)
(running mrmedianobs_work on estimation sample)

Bootstrap replications (10)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..........

                                                      Number of genotypes = 20
                                                          Number of obs = 1000
                                                             Replications = 10
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .9986435   .0149929    66.61   0.000      .969258    1.028029
------------------------------------------------------------------------------

. 
. mrmedianobs y (x = z*), obsboot reps(10) seed(12345) weighted
(running mrmedianobs_work on estimation sample)

Bootstrap replications (10)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..........

                                                      Number of genotypes = 20
                                                          Number of obs = 1000
                                                             Replications = 10
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .9987268   .0203573    49.06   0.000     .9588273    1.038626
------------------------------------------------------------------------------

. 
. mrmedianobs y (x = z*), obsboot reps(10) seed(12345) penweighted
(running mrmedianobs_work on estimation sample)

Bootstrap replications (10)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..........

                                                      Number of genotypes = 20
                                                          Number of obs = 1000
                                                             Replications = 10
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .9987268   .0203573    49.06   0.000     .9588273    1.038626
------------------------------------------------------------------------------

. 
. *** test percentile ci limits
. mrmedianobs y (x = z*), obsboot reps(10) seed(12345) all
(running mrmedianobs_work on estimation sample)

Bootstrap replications (10)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..........
------------------------------------------------------------------------------
             |    Observed               Bootstrap
             |       Coef.       Bias    Std. Err.  [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .99864349  -.0014599   .01499286     .969258   1.028029   (N)
             |                                       .9654705   1.018876   (P)
             |                                       .9654705   1.018876  (BC)
------------------------------------------------------------------------------
(N)    normal confidence interval
(P)    percentile confidence interval
(BC)   bias-corrected confidence interval

                                                      Number of genotypes = 20
                                                          Number of obs = 1000
                                                             Replications = 10
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .9986435   .0149929    66.61   0.000      .969258    1.028029
------------------------------------------------------------------------------

. mat list r(table)

r(table)[9,1]
             beta
     b  .99864349
    se  .01499286
     z  66.607959
pvalue          0
    ll  .96925803
    ul  1.0280289
    df          .
  crit   1.959964
 eform          0

. 
. rcof "mrmedianobs y (x = z*), reps(10) seed(12345) all" == 198

. 
. rcof "mrmedianobs y (x = z1-z2), reps(10) seed(12345)" == 2001

. rcof "mrmedianobs y (x = z1), reps(10) seed(12345)" == 2001

. rcof "mrmedianobs y (x = z1-z20) in 1/2, reps(10) seed(12345)" == 2001

. rcof "mrmedianobs y (x = z1-z20) in 1, reps(10) seed(12345)" == 2001

. 
. mrmedianobs y (x = z1-z3), reps(10) seed(12345) level(90)

                                                       Number of genotypes = 3
                                                          Number of obs = 1000
                                                             Replications = 10
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [90% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .9913514   .0979108    10.13   0.000     .8303024      1.1524
------------------------------------------------------------------------------

. mrmedianobs, level(95)

                                                       Number of genotypes = 3
                                                          Number of obs = 1000
                                                             Replications = 10
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .9913514   .0979108    10.13   0.000     .7994497    1.183253
------------------------------------------------------------------------------

. 
end of do-file
      name:  mrmedianobs
       log:  C:\Users\eptmp\Documents\GitHub\mrrobust\cscripts\mrmedianobs.log
  log type:  text
 closed on:  25 Jun 2021, 10:35:17
-------------------------------------------------------------------------------
