-------------------------------------------------------------------------------
      name:  mrmodalplot
       log:  C:\Users\eptmp\Documents\GitHub\mrrobust\cscripts\mrmodalplot.log
  log type:  text
 opened on:   1 Feb 2022, 11:21:20

. * mrmodalplot example
. * 2aug2017
. 
. cscript mrmodalplot adofiles mrmodalplot
--------------------------------------------------------------BEGIN mrmodalplot

-> which mrmodalplot, usesysdir
C:\Users\eptmp\Documents\GitHub\mrrobust\mrmodalplot.ado
*! 0.1.0 2aug2017 Tom Palmer

. 
. use https://raw.github.com/remlapmot/mrrobust/master/dodata, clear

. 
. gen byte sel1 = (ldlcp2 < 1e-8)

. 
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                     Phi = .25
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4198713   .2197838     1.91   0.056     -.010897    .8506396
------------------------------------------------------------------------------

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                      Phi = .5
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4218667   .1951393     2.16   0.031     .0394007    .8043328
------------------------------------------------------------------------------

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4917353   .1430383     3.44   0.001     .2113853    .7720853
------------------------------------------------------------------------------

. 
. * Simple mode estimator
. mrmodal chdbeta chdse ldlcbeta ldlcse if sel1==1, seed(12345)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4917353   .1356432     3.63   0.000     .2258796     .757591
------------------------------------------------------------------------------

. 
. mrmodal chdbeta chdse ldlcbeta ldlcse if sel1==1, seed(12345) nosave

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4917353   .1356432     3.63   0.000     .2258796     .757591
------------------------------------------------------------------------------

. 
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1, seed(12345)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                     Phi = .25
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4198713   .2267297     1.85   0.064    -.0245107    .8642533
------------------------------------------------------------------------------

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                      Phi = .5
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4218667   .1981169     2.13   0.033     .0335647    .8101688
------------------------------------------------------------------------------

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4917353   .1356432     3.63   0.000     .2258796     .757591
------------------------------------------------------------------------------

. 
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1, seed(12345) reps(100)

                                                      Number of genotypes = 73
                                                            Replications = 100
                                                                     Phi = .25
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4198713   .2295545     1.83   0.067    -.0300472    .8697898
------------------------------------------------------------------------------

                                                      Number of genotypes = 73
                                                            Replications = 100
                                                                      Phi = .5
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4218667   .2011052     2.10   0.036     .0277078    .8160257
------------------------------------------------------------------------------

                                                      Number of genotypes = 73
                                                            Replications = 100
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4917353   .1291764     3.81   0.000     .2385543    .7449163
------------------------------------------------------------------------------

. 
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1, seed(12345) phi(1)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4917353   .1356432     3.63   0.000     .2258796     .757591
------------------------------------------------------------------------------

. 
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1, seed(12345) phi(.5 1)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                      Phi = .5
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4218667   .1981169     2.13   0.033     .0335647    .8101688
------------------------------------------------------------------------------

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4917353   .1356432     3.63   0.000     .2258796     .757591
------------------------------------------------------------------------------

. 
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1, seed(12345) phi(1 1.5 2
>  2.5)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4917353   .1356432     3.63   0.000     .2258796     .757591
------------------------------------------------------------------------------

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                     Phi = 1.5
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4782134   .0992971     4.82   0.000     .2835948    .6728321
------------------------------------------------------------------------------

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 2
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |    .438605   .0853427     5.14   0.000     .2713364    .6058735
------------------------------------------------------------------------------

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                     Phi = 2.5
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4229441   .0763672     5.54   0.000     .2732672     .572621
------------------------------------------------------------------------------

. 
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1, seed(12345) phi(1) lc(g
> s0)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4917353   .1356432     3.63   0.000     .2258796     .757591
------------------------------------------------------------------------------

. 
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1, ///
>         seed(12345) lc(gs10 gs5 gs0)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                     Phi = .25
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4198713   .2267297     1.85   0.064    -.0245107    .8642533
------------------------------------------------------------------------------

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                      Phi = .5
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4218667   .1981169     2.13   0.033     .0335647    .8101688
------------------------------------------------------------------------------

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4917353   .1356432     3.63   0.000     .2258796     .757591
------------------------------------------------------------------------------

. 
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1, ///
>         seed(12345) lc(gs10 gs5 gs0) lp(solid dash longdash)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                     Phi = .25
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4198713   .2267297     1.85   0.064    -.0245107    .8642533
------------------------------------------------------------------------------

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                      Phi = .5
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4218667   .1981169     2.13   0.033     .0335647    .8101688
------------------------------------------------------------------------------

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4917353   .1356432     3.63   0.000     .2258796     .757591
------------------------------------------------------------------------------

. 
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1, ///
>         seed(12345) lc(gs10 gs5 gs0) lp(solid dash longdash) lw(vthin thin th
> ick)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                     Phi = .25
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4198713   .2267297     1.85   0.064    -.0245107    .8642533
------------------------------------------------------------------------------

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                      Phi = .5
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4218667   .1981169     2.13   0.033     .0335647    .8101688
------------------------------------------------------------------------------

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4917353   .1356432     3.63   0.000     .2258796     .757591
------------------------------------------------------------------------------

. 
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1, seed(12345) phi(1) lp(d
> ash)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4917353   .1356432     3.63   0.000     .2258796     .757591
------------------------------------------------------------------------------

. 
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1, seed(12345) phi(1) lw(v
> thick)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4917353   .1356432     3.63   0.000     .2258796     .757591
------------------------------------------------------------------------------

. 
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1, seed(12345) phi(1) ///
>         lc(gs0) lw(vthick) lp(dash)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4917353   .1356432     3.63   0.000     .2258796     .757591
------------------------------------------------------------------------------

. 
. * Weighted mode estimator
. mrmodal chdbeta chdse ldlcbeta ldlcse if sel1==1, weighted seed(12345)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4789702   .0718135     6.67   0.000     .3382183    .6197221
------------------------------------------------------------------------------

. 
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1, weighted seed(12345)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                     Phi = .25
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .5820001   .1365403     4.26   0.000      .314386    .8496142
------------------------------------------------------------------------------

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                      Phi = .5
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4906313   .1149696     4.27   0.000      .265295    .7159676
------------------------------------------------------------------------------

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4789702   .0718135     6.67   0.000     .3382183    .6197221
------------------------------------------------------------------------------

. 
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1, weighted seed(12345) ph
> i(1)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4789702   .0718135     6.67   0.000     .3382183    .6197221
------------------------------------------------------------------------------

. 
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1, weighted seed(12345) ph
> i(.5 1)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                      Phi = .5
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4906313   .1149696     4.27   0.000      .265295    .7159676
------------------------------------------------------------------------------

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4789702   .0718135     6.67   0.000     .3382183    .6197221
------------------------------------------------------------------------------

. 
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1, weighted seed(12345) ph
> i(1 1.5 2 2.5)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4789702   .0718135     6.67   0.000     .3382183    .6197221
------------------------------------------------------------------------------

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                     Phi = 1.5
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4782134   .0575822     8.30   0.000     .3653544    .5910725
------------------------------------------------------------------------------

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 2
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4847262   .0516013     9.39   0.000     .3835896    .5858628
------------------------------------------------------------------------------

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                     Phi = 2.5
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4729783    .048249     9.80   0.000      .378412    .5675447
------------------------------------------------------------------------------

. 
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1, weighted seed(12345) ph
> i(1) lc(gs0)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4789702   .0718135     6.67   0.000     .3382183    .6197221
------------------------------------------------------------------------------

. 
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1, weighted seed(12345) ph
> i(1) lp(dash)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4789702   .0718135     6.67   0.000     .3382183    .6197221
------------------------------------------------------------------------------

. 
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1, weighted seed(12345) ph
> i(1) lw(vthick)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4789702   .0718135     6.67   0.000     .3382183    .6197221
------------------------------------------------------------------------------

. 
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1, weighted seed(12345) ph
> i(1) ///
>         lc(gs0) lw(vthick) lp(dash)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4789702   .0718135     6.67   0.000     .3382183    .6197221
------------------------------------------------------------------------------

. 
. * Simple mode estimator with NOME assumption
. mrmodal chdbeta chdse ldlcbeta ldlcse if sel1==1, nome

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4917353   .1313224     3.74   0.000     .2343481    .7491225
------------------------------------------------------------------------------

. 
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1, nome seed(12345)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                     Phi = .25
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4198713   .2273152     1.85   0.065    -.0256584     .865401
------------------------------------------------------------------------------

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                      Phi = .5
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4218667   .1953752     2.16   0.031     .0389384    .8047951
------------------------------------------------------------------------------

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4917353   .1354745     3.63   0.000     .2262101    .7572605
------------------------------------------------------------------------------

. 
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1, nome seed(12345) phi(1)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4917353   .1354745     3.63   0.000     .2262101    .7572605
------------------------------------------------------------------------------

. 
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1, nome seed(12345) phi(.5
>  1)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                      Phi = .5
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4218667   .1953752     2.16   0.031     .0389384    .8047951
------------------------------------------------------------------------------

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4917353   .1354745     3.63   0.000     .2262101    .7572605
------------------------------------------------------------------------------

. 
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1, nome seed(12345) phi(1 
> 1.5 2 2.5)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4917353   .1354745     3.63   0.000     .2262101    .7572605
------------------------------------------------------------------------------

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                     Phi = 1.5
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4782134   .0991844     4.82   0.000     .2838156    .6726112
------------------------------------------------------------------------------

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 2
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |    .438605   .0849872     5.16   0.000     .2720331    .6051769
------------------------------------------------------------------------------

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                     Phi = 2.5
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4229441   .0761031     5.56   0.000     .2737847    .5721035
------------------------------------------------------------------------------

. 
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1, nome seed(12345) phi(1)
>  lc(gs0)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4917353   .1354745     3.63   0.000     .2262101    .7572605
------------------------------------------------------------------------------

. 
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1, nome seed(12345) phi(1)
>  lp(dash)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4917353   .1354745     3.63   0.000     .2262101    .7572605
------------------------------------------------------------------------------

. 
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1, nome seed(12345) phi(1)
>  lw(vthick)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4917353   .1354745     3.63   0.000     .2262101    .7572605
------------------------------------------------------------------------------

. 
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1, nome seed(12345) phi(1)
>  ///
>         lc(gs0) lw(vthick) lp(dash)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4917353   .1354745     3.63   0.000     .2262101    .7572605
------------------------------------------------------------------------------

. 
. * Weighted mode estimator with NOME assumption
. mrmodal chdbeta chdse ldlcbeta ldlcse if sel1==1, weighted nome

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4789702   .0674035     7.11   0.000     .3468618    .6110786
------------------------------------------------------------------------------

. 
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1, nome weighted seed(1234
> 5)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                     Phi = .25
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .5820001   .1351747     4.31   0.000     .3170626    .8469376
------------------------------------------------------------------------------

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                      Phi = .5
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4906313   .1144836     4.29   0.000     .2662474    .7150151
------------------------------------------------------------------------------

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4789702   .0712874     6.72   0.000     .3392495    .6186909
------------------------------------------------------------------------------

. 
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1, nome weighted seed(1234
> 5) phi(1)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4789702   .0712874     6.72   0.000     .3392495    .6186909
------------------------------------------------------------------------------

. 
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1, nome weighted seed(1234
> 5) phi(.5 1)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                      Phi = .5
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4906313   .1144836     4.29   0.000     .2662474    .7150151
------------------------------------------------------------------------------

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4789702   .0712874     6.72   0.000     .3392495    .6186909
------------------------------------------------------------------------------

. 
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1, nome weighted seed(1234
> 5) phi(1 1.5 2 2.5)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4789702   .0712874     6.72   0.000     .3392495    .6186909
------------------------------------------------------------------------------

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                     Phi = 1.5
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4782134   .0574266     8.33   0.000     .3656593    .5907676
------------------------------------------------------------------------------

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 2
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4847262   .0513146     9.45   0.000     .3841513    .5853011
------------------------------------------------------------------------------

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                     Phi = 2.5
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4896564   .0477916    10.25   0.000     .3959865    .5833263
------------------------------------------------------------------------------

. 
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1, nome weighted seed(1234
> 5) phi(1) lc(gs0)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4789702   .0712874     6.72   0.000     .3392495    .6186909
------------------------------------------------------------------------------

. 
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1, nome weighted seed(1234
> 5) phi(1) lp(dash)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4789702   .0712874     6.72   0.000     .3392495    .6186909
------------------------------------------------------------------------------

. 
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1, nome weighted seed(1234
> 5) phi(1) lw(vthick)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4789702   .0712874     6.72   0.000     .3392495    .6186909
------------------------------------------------------------------------------

. 
. mrmodalplot chdbeta chdse ldlcbeta ldlcse if sel1==1, nome weighted seed(1234
> 5) phi(1) ///
>         lc(gs0) lw(vthick) lp(dash)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   .4789702   .0712874     6.72   0.000     .3392495    .6186909
------------------------------------------------------------------------------

. 
end of do-file
      name:  mrmodalplot
       log:  C:\Users\eptmp\Documents\GitHub\mrrobust\cscripts\mrmodalplot.log
  log type:  text
 closed on:   1 Feb 2022, 11:22:38
-------------------------------------------------------------------------------
