-------------------------------------------------------------------------------
      name:  mrmodal
       log:  C:\Users\palmertm\Documents\all\work\mregger\GitHub\mrrobust\cscri
> pts\mrmodal.log
  log type:  text
 opened on:  20 Jan 2020, 09:12:21

. * mrmodal cscript
. * 2jun2017
. 
. cscript mrivests adofiles mrivests
-----------------------------------------------------------------BEGIN mrivests

-> which mrivests, usesysdir
H:\ado\plus\m\mrivests.ado
*! 0.1.0 Tom Palmer 10jun2017

. 
. use https://raw.github.com/remlapmot/mrrobust/master/dodata, clear

. 
. ** error messages
. 
. ** estimation examples
. ** ldlc
. 
. gen byte sel1 = 1 if ldlcp2 < 1e-8
(112 missing values generated)

. count if sel1 == 1
  73

. gen double BetaYG = chdbeta

. gen double BetaXG = ldlcbeta

. gen double seBetaYG = chdse

. gen double seBetaXG = ldlcse

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel1==1, seed(12345)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .4917353   .1356432     3.63   0.000     .2258796     .757591
------------------------------------------------------------------------------

. assert abs(_b[beta] - .4917353) < 1e-7

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel1==1, seed(12345) level(90)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [90% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .4917353   .1356432     3.63   0.000     .2686221    .7148484
------------------------------------------------------------------------------

. 
. mrmodal

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .4917353   .1356432     3.63   0.000     .2258796     .757591
------------------------------------------------------------------------------

. 
. mrmodal, level(90)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [90% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .4917353   .1356432     3.63   0.000     .2686221    .7148484
------------------------------------------------------------------------------

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel1==1, phi(.5)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                      Phi = .5
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .4218667   .1857483     2.27   0.023     .0578068    .7859267
------------------------------------------------------------------------------

. assert abs(_b[beta] - .4218667) < 1e-7

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel1==1, phi(.25)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                     Phi = .25
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .4198713   .2261642     1.86   0.063    -.0234025     .863145
------------------------------------------------------------------------------

. assert abs(_b[beta] - .4198713) < 1e-7

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel1==1, weighted

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .4789702   .0674841     7.10   0.000     .3467038    .6112366
------------------------------------------------------------------------------

. assert abs(_b[beta] - .4789702) < 1e-7

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel1==1, phi(.5) weighted

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                      Phi = .5
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .4906313   .1151202     4.26   0.000     .2649999    .7162626
------------------------------------------------------------------------------

. assert abs(_b[beta] -.4906313) < 1e-7

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel1==1, phi(.25) weighted

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                     Phi = .25
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .5820001   .1364848     4.26   0.000     .3144948    .8495054
------------------------------------------------------------------------------

. assert abs(_b[beta] - .5820001) < 1e-7

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel1==1, nome

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .4917353   .1319598     3.73   0.000     .2330988    .7503717
------------------------------------------------------------------------------

. assert abs(_b[beta] - .4917353) < 1e-7

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel1==1, phi(.5) nome

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                      Phi = .5
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .4218667   .1893127     2.23   0.026     .0508207    .7929128
------------------------------------------------------------------------------

. assert abs(_b[beta] -.4218667) < 1e-7

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel1==1, phi(.25) nome

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                     Phi = .25
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .4198713   .2233716     1.88   0.060    -.0179291    .8576716
------------------------------------------------------------------------------

. assert abs(_b[beta] - .4198713) < 1e-7

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel1==1, weighted nome

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .4789702   .0702727     6.82   0.000     .3412382    .6167022
------------------------------------------------------------------------------

. assert abs(_b[beta] - .4789702) < 1e-7

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel1==1, weighted nome phi(.5)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                      Phi = .5
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .4906313   .1117767     4.39   0.000      .271553    .7097095
------------------------------------------------------------------------------

. assert abs(_b[beta] - .4906313) < 1e-7

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel1==1, weighted nome phi(.25)

                                                      Number of genotypes = 73
                                                           Replications = 1000
                                                                     Phi = .25
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .5820001   .1333661     4.36   0.000     .3206073    .8433929
------------------------------------------------------------------------------

. assert abs(_b[beta] - .5820001) < 1e-7

. 
. ** hdlc example
. 
. gen byte sel2 = 1 if hdlcp2 < 1e-8
(100 missing values generated)

. count if sel2 == 1
  85

. cap noi drop BetaYG

. cap noi drop seBetaYG

. cap noi drop BetaXG

. cap noi drop seBetaXG

. gen double BetaYG = chdbeta

. gen double BetaXG = hdlcbeta

. gen double seBetaYG = chdse

. gen double seBetaXG = hdlcse

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel2==1, seed(12345)

                                                      Number of genotypes = 85
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |  -.1340609   .1460344    -0.92   0.359    -.4202831    .1521613
------------------------------------------------------------------------------

. assert abs(_b[beta] - -.13406091) < 1e-8

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel2==1, phi(.5) seed(12345)

                                                      Number of genotypes = 85
                                                           Replications = 1000
                                                                      Phi = .5
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |  -.1742257   .2179792    -0.80   0.424    -.6014572    .2530057
------------------------------------------------------------------------------

. assert abs(_b[beta] - -.174225711) < 1e-8

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel2==1, phi(.25) seed(12345)

                                                      Number of genotypes = 85
                                                           Replications = 1000
                                                                     Phi = .25
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |  -.2538561   .2561904    -0.99   0.322      -.75598    .2482678
------------------------------------------------------------------------------

. assert abs(_b[beta] - -.253856075) < 1e-8

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel2==1, seed(12345) weighted 

                                                      Number of genotypes = 85
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |    -.02958     .06483    -0.46   0.648    -.1566444    .0974844
------------------------------------------------------------------------------

. assert abs(_b[beta] - -.02957998) < 1e-8

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel2==1, phi(.5) seed(12345) weigh
> ted 

                                                      Number of genotypes = 85
                                                           Replications = 1000
                                                                      Phi = .5
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |  -.0028893   .0891113    -0.03   0.974    -.1775442    .1717655
------------------------------------------------------------------------------

. assert abs(_b[beta] - -.002889325) < 1e-8

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel2==1, phi(.25) seed(12345) weig
> hted 

                                                      Number of genotypes = 85
                                                           Replications = 1000
                                                                     Phi = .25
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |  -.0205773   .1149965    -0.18   0.858    -.2459663    .2048117
------------------------------------------------------------------------------

. assert abs(_b[beta] - -.020577298) < 1e-8

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel2==1, seed(12345) nome

                                                      Number of genotypes = 85
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |  -.1340609   .1488509    -0.90   0.368    -.4258033    .1576815
------------------------------------------------------------------------------

. assert abs(_b[beta] - -.13406091) < 1e-8

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel2==1, phi(.5) seed(12345) nome

                                                      Number of genotypes = 85
                                                           Replications = 1000
                                                                      Phi = .5
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |  -.1742257   .2186466    -0.80   0.426    -.6027652    .2543137
------------------------------------------------------------------------------

. assert abs(_b[beta] - -.174225711) < 1e-8

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel2==1, phi(.25) seed(12345) nome

                                                      Number of genotypes = 85
                                                           Replications = 1000
                                                                     Phi = .25
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |  -.2538561   .2619731    -0.97   0.333     -.767314    .2596019
------------------------------------------------------------------------------

. assert abs(_b[beta] - -.253856075) < 1e-8

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel2==1, seed(12345) weighted nome

                                                      Number of genotypes = 85
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |    -.02958   .0650554    -0.45   0.649    -.1570863    .0979264
------------------------------------------------------------------------------

. assert abs(_b[beta] - -.02957998) < 1e-8

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel2==1, phi(.5) seed(12345) nome 
> weighted 

                                                      Number of genotypes = 85
                                                           Replications = 1000
                                                                      Phi = .5
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |  -.0028893   .0894804    -0.03   0.974    -.1782676    .1724889
------------------------------------------------------------------------------

. assert abs(_b[beta] - -.002889325) < 1e-8

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel2==1, phi(.25) seed(12345) nome
>  weighted 

                                                      Number of genotypes = 85
                                                           Replications = 1000
                                                                     Phi = .25
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |  -.0205773   .1162931    -0.18   0.860    -.2485076     .207353
------------------------------------------------------------------------------

. assert abs(_b[beta] - -.020577298) < 1e-8

. 
. ** tg example
. 
. gen byte sel3 = 1 if tgp2 < 1e-8
(138 missing values generated)

. count if sel3 == 1
  47

. cap noi drop BetaYG

. cap noi drop seBetaYG

. cap noi drop BetaXG

. cap noi drop seBetaXG

. gen double BetaYG = chdbeta

. gen double BetaXG = tgbeta

. gen double seBetaYG = chdse

. gen double seBetaXG = tgse

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel3==1, seed(12345)

                                                      Number of genotypes = 47
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .6835468   .1856822     3.68   0.000     .3196164    1.047477
------------------------------------------------------------------------------

. assert abs(_b[beta] - .6835468) < 1e-8

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel3==1, phi(.5) seed(12345)

                                                      Number of genotypes = 47
                                                           Replications = 1000
                                                                      Phi = .5
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .8170654   .2666853     3.06   0.002     .2943718    1.339759
------------------------------------------------------------------------------

. assert abs(_b[beta] - .8170654) < 1e-7

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel3==1, phi(.25) seed(12345)

                                                      Number of genotypes = 47
                                                           Replications = 1000
                                                                     Phi = .25
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .8826142   .3138704     2.81   0.005     .2674395    1.497789
------------------------------------------------------------------------------

. assert abs(_b[beta] - .8749913) < 1e-2

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel3==1, seed(12345) weighted 

                                                      Number of genotypes = 47
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .5396388   .0868696     6.21   0.000     .3693774    .7099001
------------------------------------------------------------------------------

. assert abs(_b[beta] - .5396388) < 1e-4

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel3==1, phi(.5) seed(12345) weigh
> ted 

                                                      Number of genotypes = 47
                                                           Replications = 1000
                                                                      Phi = .5
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .5788325   .1220253     4.74   0.000     .3396672    .8179977
------------------------------------------------------------------------------

. assert abs(_b[beta] - .5788325) < 1e-6

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel3==1, phi(.25) seed(12345) weig
> hted 

                                                      Number of genotypes = 47
                                                           Replications = 1000
                                                                     Phi = .25
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .5472065   .1410463     3.88   0.000     .2707607    .8236522
------------------------------------------------------------------------------

. assert abs(_b[beta] - .5472065) < 1e-6

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel3==1, seed(12345) nome

                                                      Number of genotypes = 47
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .6835468   .1847678     3.70   0.000     .3214085    1.045685
------------------------------------------------------------------------------

. assert abs(_b[beta] - .6835468) < 1e-8

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel3==1, phi(.5) seed(12345) nome

                                                      Number of genotypes = 47
                                                           Replications = 1000
                                                                      Phi = .5
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .8170654   .2659087     3.07   0.002     .2958939    1.338237
------------------------------------------------------------------------------

. assert abs(_b[beta] - .8170654) < 1e-7

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel3==1, phi(.25) seed(12345) nome

                                                      Number of genotypes = 47
                                                           Replications = 1000
                                                                     Phi = .25
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .8826142   .3240802     2.72   0.006     .2474287      1.5178
------------------------------------------------------------------------------

. assert abs(_b[beta] - .8479913) < 1e-1

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel3==1, seed(12345) weighted nome

                                                      Number of genotypes = 47
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .5499179   .0862447     6.38   0.000     .3808813    .7189545
------------------------------------------------------------------------------

. assert abs(_b[beta] - .5499179) < 1e-7

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel3==1, phi(.5) seed(12345) nome 
> weighted 

                                                      Number of genotypes = 47
                                                           Replications = 1000
                                                                      Phi = .5
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .5788325   .1207149     4.80   0.000     .3422355    .8154294
------------------------------------------------------------------------------

. assert abs(_b[beta] - .5788325) < 1e-7

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel3==1, phi(.25) seed(12345) nome
>  weighted 

                                                      Number of genotypes = 47
                                                           Replications = 1000
                                                                     Phi = .25
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .5472065   .1390793     3.93   0.000     .2746162    .8197968
------------------------------------------------------------------------------

. assert abs(_b[beta] - .5472065) < 1e-7

. 
. ** nosave option
. mata mata clear

. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel3==1, phi(.5) seed(12345) weigh
> ted

                                                      Number of genotypes = 47
                                                           Replications = 1000
                                                                      Phi = .5
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .5788325   .1220253     4.74   0.000     .3396672    .8179977
------------------------------------------------------------------------------

. mata mata desc

      # bytes   type                        name and extent
-------------------------------------------------------------------------------
        4,096   real colvector              mrmodal_densityiv[512]
        4,096   real colvector              mrmodal_g[512]
-------------------------------------------------------------------------------

. 
. mata mata clear

. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel3==1, phi(.5) seed(12345) nosav
> e weighted

                                                      Number of genotypes = 47
                                                           Replications = 1000
                                                                      Phi = .5
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .5788325   .1220253     4.74   0.000     .3396672    .8179977
------------------------------------------------------------------------------

. cap noi mata mrmodal_densityiv
                 <istmt>:  3499  mrmodal_densityiv not found

. assert _rc == 3499

. cap noi mata mrmodal_g
                 <istmt>:  3499  mrmodal_g not found

. assert _rc == 3499

. 
. mrmodal BetaYG seBetaYG BetaXG seBetaXG if sel3==1, seed(12345)

                                                      Number of genotypes = 47
                                                           Replications = 1000
                                                                       Phi = 1
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .6835468   .1856822     3.68   0.000     .3196164    1.047477
------------------------------------------------------------------------------

. 
end of do-file
      name:  mrmodal
       log:  C:\Users\palmertm\Documents\all\work\mregger\GitHub\mrrobust\cscri
> pts\mrmodal.log
  log type:  text
 closed on:  20 Jan 2020, 09:12:44
-------------------------------------------------------------------------------
