-------------------------------------------------------------------------------
      name:  mrratio
       log:  /Users/tom/Documents/GitHub/mrrobust/cscripts/mrratio.log
  log type:  text
 opened on:  27 Jan 2024, 18:26:18

. * mrratio cscript
. * 6jun2017
. 
. cscript mrratio adofiles mrratio
------------------------------------------------------------------BEGIN mrratio

-> which mrratio, usesysdir
/Users/tom/Documents/GitHub/mrrobust/mrratio.ado
*! 1.0.0 Tom Palmer 30may2017, based on my old tsci.ado from 8jan2010

. 
. about

Stata/MP 18.0 for Mac (Apple Silicon)
Revision 20 Dec 2023
Copyright 1985-2023 StataCorp LLC

Total physical memory: 8.01 GB

Stata license: Unlimited-user 2-core network, expiring 29 Jan 2025
Serial number: 501809305331
  Licensed to: Tom Palmer
               University of Bristol

. 
. // basic call
. mrratio 1 .5 1 .25

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |          1    .559017     1.79   0.074    -.0956532    2.095653
------------------------------------------------------------------------------

. eret list

scalars:
         e(fiellerres) =  .
              e(level) =  95

macros:
            e(cmdline) : "mrratio 1 .5 1 .25"
                e(cmd) : "mrratio"
         e(properties) : "b V"

matrices:
                  e(b) :  1 x 1
                  e(V) :  1 x 1

. assert _b[beta] == 1

. assert abs(_se[beta] - .559017) < 1e-6

. assert e(fiellerres) == .

. mat li r(table)

r(table)[9,1]
              beta
     b           1
    se   .55901699
     z   1.7888544
pvalue   .07363827
    ll  -.09565318
    ul   2.0956532
    df           .
  crit    1.959964
 eform           0

. 
. // test replay
. mrratio

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |          1    .559017     1.79   0.074    -.0956532    2.095653
------------------------------------------------------------------------------

. assert _b[beta] == 1

. assert abs(_se[beta] - .559017) < 1e-6

. assert e(level) == 95

. 
. mrratio, level(90)

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [90% conf. interval]
-------------+----------------------------------------------------------------
        beta |          1    .559017     1.79   0.074     .0804989    1.919501
------------------------------------------------------------------------------

. 
. mrratio 1 .5 1 .25, eform

------------------------------------------------------------------------------
             |      exp()   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   2.718282   1.519566     1.79   0.074     .9087791     8.13075
------------------------------------------------------------------------------

. mat li r(table)

r(table)[9,1]
             beta
     b  2.7182818
    se  1.5195657
     z  1.7888544
pvalue  .07363827
    ll  .90877915
    ul    8.13075
    df          .
  crit   1.959964
 eform          1

. mrratio

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |          1    .559017     1.79   0.074    -.0956532    2.095653
------------------------------------------------------------------------------

. mrratio, eform

------------------------------------------------------------------------------
             |      exp()   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   2.718282   1.519566     1.79   0.074     .9087791     8.13075
------------------------------------------------------------------------------

. 
. mrratio 1 .5 1 .25, eform level(90)

------------------------------------------------------------------------------
             |      exp()   Std. err.      z    P>|z|     [90% conf. interval]
-------------+----------------------------------------------------------------
        beta |   2.718282   1.519566     1.79   0.074     1.083828    6.817557
------------------------------------------------------------------------------

. mrratio, eform

------------------------------------------------------------------------------
             |      exp()   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   2.718282   1.519566     1.79   0.074     .9087791     8.13075
------------------------------------------------------------------------------

. mrratio, eform level(90)

------------------------------------------------------------------------------
             |      exp()   Std. err.      z    P>|z|     [90% conf. interval]
-------------+----------------------------------------------------------------
        beta |   2.718282   1.519566     1.79   0.074     1.083828    6.817557
------------------------------------------------------------------------------

. 
. // fieller
. mrratio 1 .5 1 .25, fieller

Ratio estimate: 1
95% Fieller CI: [.0199692, 2.611926]

. eret list

scalars:
            e(lowerci) =  .0199691608403421
            e(upperci) =  2.611925531794721
         e(fiellerres) =  1
              e(level) =  95

macros:
            e(cmdline) : "mrratio 1 .5 1 .25, fieller"
                e(cmd) : "mrratio"
         e(properties) : "b"

matrices:
                  e(b) :  1 x 1

. assert e(fiellerres) == 1

. assert _b[beta] == 1

. assert abs(e(lowerci) - .019969) < 1e-6

. assert abs(e(upperci) - 2.611925) < 1e-6

. 
. mrratio

Ratio estimate: 1
95% Fieller CI: [.01996916, 2.6119255]

. 
. rcof "noi mrratio, level(90)" == 198

level() option not allowed with Fieller CI with estimates replay

. 
. mrratio 1 .5 1 .25, fieller eform

exp() ratio estimate: 2.7182818
95% Fieller CI: [1.0201699, 13.625268]

. assert e(fiellerres) == 1

. assert _b[beta] == 1

. assert abs(e(lowerci) - .019969) < 1e-6

. assert abs(e(upperci) - 2.611925) < 1e-6

. 
. mrratio 1 .5 1 .25, fieller level(90)

Ratio estimate: 1
90% Fieller CI: [.1744505, 2.232568]

. assert e(level) == 90

. 
. // nome
. mrratio 1 .5 1 .25, nome

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |          1         .5     2.00   0.046      .020018    1.979982
------------------------------------------------------------------------------

. assert e(fiellerres) == .

. assert _b[beta] == 1

. assert _se[beta] == .5

. mat li r(table)

r(table)[9,1]
             beta
     b          1
    se         .5
     z          2
pvalue  .04550026
    ll  .02001801
    ul   1.979982
    df          .
  crit   1.959964
 eform          0

. mrratio

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |          1         .5     2.00   0.046      .020018    1.979982
------------------------------------------------------------------------------

. mrratio, level(90)

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [90% conf. interval]
-------------+----------------------------------------------------------------
        beta |          1         .5     2.00   0.046     .1775732    1.822427
------------------------------------------------------------------------------

. mrratio 1 .5 1 .25, nome eform

------------------------------------------------------------------------------
             |      exp()   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |   2.718282   1.359141     2.00   0.046      1.02022    7.242613
------------------------------------------------------------------------------

. 
. rcof "noi mrratio 1 .5 1 .25, nome fieller" == 198
fieller and nome options may not be specified together

. 
. // fiellerres = 2
. mrratio 1 .0007 2000 10000, fieller

Ratio estimate: .0005
95% Fieller CI is the union of two open intervals: (-Inf, -.0000568], [.0000463
> , +Inf)

. assert e(fiellerres) == 2

. assert abs(e(lowerci) - -.0000568) < 1e-7

. assert abs(e(upperci) - .0000462) < 1e-7

. mrratio

Ratio estimate: .0005
95% Fieller CI is the union of two open intervals: (-Inf, -.00005682], [.000046
> 3, +Inf)

. 
. mrratio 1 .0007 2000 10000, fieller eform

exp() ratio estimate: 1.0005001
95% Fieller CI is the union of two open intervals: (-Inf, .9999432], [1.0000463
> , +Inf)

. assert e(fiellerres) == 2

. 
. // fiellerres = 3
. mrratio .0007 10000 2000 10000, fieller

Ratio estimate: 3.500e-07
Using Fieller's Theorem, no finite confidence interval exists
other than the entire real line.

. assert e(fiellerres) == 3

. assert _b[beta] == 3.5e-7

. mrratio

Ratio estimate: 3.500e-07
Using Fieller's Theorem, no finite confidence interval exists
other than the entire real line.

. 
. // allow 3 inputs but require nome
. mrratio 1 .5 1, nome

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |          1         .5     2.00   0.046      .020018    1.979982
------------------------------------------------------------------------------

. assert _b[beta] == 1

. 
. rcof "noi mrratio 1 .5 1" == 198
With 3 inputs please specify the nome option.

. 
. mrratio 1 .5 1 .25

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        beta |          1    .559017     1.79   0.074    -.0956532    2.095653
------------------------------------------------------------------------------

. 
end of do-file
      name:  mrratio
       log:  /Users/tom/Documents/GitHub/mrrobust/cscripts/mrratio.log
  log type:  text
 closed on:  27 Jan 2024, 18:26:18
-------------------------------------------------------------------------------
