{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/tom/Documents/GitHub/mrrobust/_drafts/mvcommands-example/mvcommands-example.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 1 Feb 2022, 14:34:34
{txt}
{com}. //_1
. use https://raw.github.com/remlapmot/mrrobust/master/dodata, clear
{txt}
{com}. //_2
. gen byte sel1 = (ldlcp2 < 1e-8)
{txt}
{com}. //_3
. mrmvivw chdbeta ldlcbeta hdlcbeta [aw=1/(chdse^2)] if sel1==1

{col 55}{txt}Number of genotypes = {res}73
{col 55}{txt}Number of phenotypes = {res}2
{col 49}{txt}Standard errors: {res}Random effect
{col 47}{txt}Residual standard error = {res} 1.514
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}chdbeta      {txt}{c |}
{space 4}ldlcbeta {c |}{col 14}{res}{space 2} .4670719{col 26}{space 2} .0581901{col 37}{space 1}    8.03{col 46}{space 3}0.000{col 54}{space 4} .3530214{col 67}{space 3} .5811224
{txt}{space 4}hdlcbeta {c |}{col 14}{res}{space 2}-.2930048{col 26}{space 2} .1211822{col 37}{space 1}   -2.42{col 46}{space 3}0.016{col 54}{space 4}-.5305175{col 67}{space 3}-.0554921
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_4
. mrmvivw chdbeta ldlcbeta hdlcbeta tgbeta [aw=1/(chdse^2)] if sel1==1

{col 55}{txt}Number of genotypes = {res}73
{col 55}{txt}Number of phenotypes = {res}3
{col 49}{txt}Standard errors: {res}Random effect
{col 47}{txt}Residual standard error = {res} 1.490
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}chdbeta      {txt}{c |}
{space 4}ldlcbeta {c |}{col 14}{res}{space 2}   .42862{col 26}{space 2} .0609661{col 37}{space 1}    7.03{col 46}{space 3}0.000{col 54}{space 4} .3091286{col 67}{space 3} .5481113
{txt}{space 4}hdlcbeta {c |}{col 14}{res}{space 2}-.1941989{col 26}{space 2} .1308289{col 37}{space 1}   -1.48{col 46}{space 3}0.138{col 54}{space 4}-.4506189{col 67}{space 3} .0622211
{txt}{space 6}tgbeta {c |}{col 14}{res}{space 2} .2260456{col 26}{space 2} .1232828{col 37}{space 1}    1.83{col 46}{space 3}0.067{col 54}{space 4}-.0155842{col 67}{space 3} .4676755
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_5
. mrmvivw chdbeta ldlcbeta hdlcbeta tgbeta [aw=1/(chdse^2)] if sel1==1, ///
> gxse(ldlcse hdlcse tgse)

{col 55}{txt}Number of genotypes = {res}73
{col 55}{txt}Number of phenotypes = {res}3
{col 49}{txt}Standard errors: {res}Random effect
{col 47}{txt}Residual standard error = {res} 1.490
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}chdbeta      {txt}{c |}
{space 4}ldlcbeta {c |}{col 14}{res}{space 2}   .42862{col 26}{space 2} .0609661{col 37}{space 1}    7.03{col 46}{space 3}0.000{col 54}{space 4} .3091286{col 67}{space 3} .5481113
{txt}{space 4}hdlcbeta {c |}{col 14}{res}{space 2}-.1941989{col 26}{space 2} .1308289{col 37}{space 1}   -1.48{col 46}{space 3}0.138{col 54}{space 4}-.4506189{col 67}{space 3} .0622211
{txt}{space 6}tgbeta {c |}{col 14}{res}{space 2} .2260456{col 26}{space 2} .1232828{col 37}{space 1}    1.83{col 46}{space 3}0.067{col 54}{space 4}-.0155842{col 67}{space 3} .4676755
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 2}Q_A statistic for instrument validity; chi2({res}70{txt}) = {res}152.88 {txt}(p =  {res}0.0000{txt})
{col 2}Conditional F-statistics for instrument strength:
{col 2}F_x1 = {res}130.31 {col 18}{txt}({res}ldlcbeta{txt})
{col 2}F_x2 = {res}36.29 {col 18}{txt}({res}hdlcbeta{txt})
{col 2}F_x3 = {res}40.44 {col 18}{txt}({res}tgbeta{txt})

{com}. //_6
. mrmvegger chdbeta ldlcbeta hdlcbeta tgbeta [aw=1/(chdse^2)] if sel1==1

{col 40}{txt}MVMR-Egger model oriented wrt: {res}ldlcbeta
{col 55}{txt}Number of genotypes = {res}73
{col 55}{txt}Number of phenotypes = {res}3
{col 47}{txt}Residual standard error = {res} 1.469
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}chdbeta      {txt}{c |}
{space 4}ldlcbeta {c |}{col 14}{res}{space 2} .5672993{col 26}{space 2} .1002611{col 37}{space 1}    5.66{col 46}{space 3}0.000{col 54}{space 4}  .370791{col 67}{space 3} .7638075
{txt}{space 4}hdlcbeta {c |}{col 14}{res}{space 2}-.1364113{col 26}{space 2} .1332727{col 37}{space 1}   -1.02{col 46}{space 3}0.306{col 54}{space 4}-.3976209{col 67}{space 3} .1247983
{txt}{space 6}tgbeta {c |}{col 14}{res}{space 2} .2739803{col 26}{space 2} .1246927{col 37}{space 1}    2.20{col 46}{space 3}0.028{col 54}{space 4} .0295871{col 67}{space 3} .5183735
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0093655{col 26}{space 2} .0054187{col 37}{space 1}   -1.73{col 46}{space 3}0.084{col 54}{space 4} -.019986{col 67}{space 3}  .001255
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_7
. mrmvegger chdbeta ldlcbeta hdlcbeta tgbeta [aw=1/(chdse^2)] if sel1==1, ///
> orient(2)

{col 40}{txt}MVMR-Egger model oriented wrt: {res}hdlcbeta
{col 55}{txt}Number of genotypes = {res}73
{col 55}{txt}Number of phenotypes = {res}3
{col 47}{txt}Residual standard error = {res} 1.501
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}chdbeta      {txt}{c |}
{space 4}ldlcbeta {c |}{col 14}{res}{space 2} .4286398{col 26}{space 2} .0614056{col 37}{space 1}    6.98{col 46}{space 3}0.000{col 54}{space 4}  .308287{col 67}{space 3} .5489926
{txt}{space 4}hdlcbeta {c |}{col 14}{res}{space 2}-.1989637{col 26}{space 2} .1541909{col 37}{space 1}   -1.29{col 46}{space 3}0.197{col 54}{space 4}-.5011723{col 67}{space 3} .1032449
{txt}{space 6}tgbeta {c |}{col 14}{res}{space 2} .2256794{col 26}{space 2} .1243221{col 37}{space 1}    1.82{col 46}{space 3}0.069{col 54}{space 4}-.0179875{col 67}{space 3} .4693463
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0002155{col 26}{space 2} .0036218{col 37}{space 1}    0.06{col 46}{space 3}0.953{col 54}{space 4} -.006883{col 67}{space 3} .0073141
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_8
. mrmvegger chdbeta ldlcbeta hdlcbeta tgbeta [aw=1/(chdse^2)] if sel1==1, ///
> orient(3)

{col 42}{txt}MVMR-Egger model oriented wrt: {res}tgbeta
{col 55}{txt}Number of genotypes = {res}73
{col 55}{txt}Number of phenotypes = {res}3
{col 47}{txt}Residual standard error = {res} 1.499
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}chdbeta      {txt}{c |}
{space 4}ldlcbeta {c |}{col 14}{res}{space 2} .4203073{col 26}{space 2} .0660026{col 37}{space 1}    6.37{col 46}{space 3}0.000{col 54}{space 4} .2909447{col 67}{space 3}   .54967
{txt}{space 4}hdlcbeta {c |}{col 14}{res}{space 2}-.1903089{col 26}{space 2} .1321536{col 37}{space 1}   -1.44{col 46}{space 3}0.150{col 54}{space 4}-.4493252{col 67}{space 3} .0687075
{txt}{space 6}tgbeta {c |}{col 14}{res}{space 2} .2065651{col 26}{space 2} .1365427{col 37}{space 1}    1.51{col 46}{space 3}0.130{col 54}{space 4}-.0610537{col 67}{space 3}  .474184
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0013499{col 26}{space 2}  .003951{col 37}{space 1}    0.34{col 46}{space 3}0.733{col 54}{space 4}-.0063939{col 67}{space 3} .0090936
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/tom/Documents/GitHub/mrrobust/_drafts/mvcommands-example/mvcommands-example.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 1 Feb 2022, 14:34:34
{txt}{.-}
{smcl}
{txt}{sf}{ul off}