{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/tom/Documents/GitHub/mrrobust/_drafts/markstat-call-R-example/markstat-call-R-example.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 6 Apr 2023, 10:58:11
{txt}
{com}. //_1
. * ssc install whereis
. * ssc install markstat
. //_2
. if c(os) == "Windows" local rpath "C:\\Program Files\\R\\R-4.2.3\\bin\\x64\\R.exe"
{txt}
{com}. else if c(os) == "Unix" local rpath "/usr/bin/R"
{txt}
{com}. else local rpath "/usr/local/bin/R"
{txt}
{com}. whereis R "`rpath'"
{res}{txt}/usr/local/bin/R

{com}. //_3
. use dat, clear
{txt}(Written by R.              )

{com}. ds, v(28)
{txt}{col 1}SNP{col 25}remove{col 49}outcome{col 73}target_a2_outcome{col 97}pval_origin_exposure
{col 1}effect_allele_exposure{col 25}palindromic{col 49}originalname_outcome{col 73}proxy_a1_outcome{col 97}id_exposure
{col 1}other_allele_exposure{col 25}ambiguous{col 49}outcome_deprecated{col 73}proxy_a2_outcome{col 97}action
{col 1}effect_allele_outcome{col 25}id_outcome{col 49}mr_keep_outcome{col 73}exposure{col 97}mr_keep
{col 1}other_allele_outcome{col 25}chr{col 49}data_source_outcome{col 73}chr_exposure{col 97}labels
{col 1}beta_exposure{col 25}pos{col 49}proxy_outcome{col 73}pos_exposure
{col 1}beta_outcome{col 25}se_outcome{col 49}target_snp_outcome{col 73}se_exposure
{col 1}eaf_exposure{col 25}samplesize_outcome{col 49}proxy_snp_outcome{col 73}pval_exposure
{col 1}eaf_outcome{col 25}pval_outcome{col 49}target_a1_outcome{col 73}mr_keep_exposure

{com}. di _N
{res}62
{txt}
{com}. //_4
. mregger beta_outcome beta_exposure [aw=1/(se_outcome^2)], ivw

{col 55}{txt}Number of genotypes = {res}62
{col 47}{txt}Residual standard error = {res} 1.749
{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |} Coefficient{col 27}  Std. err.{col 39}      z{col 47}   P>|z|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}beta_outcome  {txt}{c |}
beta_exposure {c |}{col 15}{res}{space 2} .4686211{col 27}{space 2} .0391937{col 38}{space 1}   11.96{col 47}{space 3}0.000{col 55}{space 4} .3918029{col 68}{space 3} .5454394
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_5
. mrforest beta_outcome se_outcome beta_exposure se_exposure, ivid(SNP) ///
> xlabel(-3,-2,-1,0,1,2,3)
{res}{txt}
{com}. graph export ldl-chd-mrforest.svg, width(600) replace
{txt}{p 0 4 2}
file {bf}
ldl-chd-mrforest.svg{rm}
saved as
SVG
format
{p_end}

{com}. //_6
. mreggerplot beta_outcome se_outcome beta_exposure se_exposure
{res}{txt}
{com}. graph export ldl-chd-mreggerplot.svg, width(600) replace
{txt}{p 0 4 2}
file {bf}
ldl-chd-mreggerplot.svg{rm}
saved as
SVG
format
{p_end}

{com}. //_7
. mregger beta_outcome beta_exposure [aw=1/(se_outcome^2)]

{col 55}{txt}Number of genotypes = {res}62
{col 47}{txt}Residual standard error = {res} 1.686
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}beta_outcome {txt}{c |}
{space 7}slope {c |}{col 14}{res}{space 2} .5854136{col 26}{space 2} .0618259{col 37}{space 1}    9.47{col 46}{space 3}0.000{col 54}{space 4} .4642371{col 67}{space 3} .7065902
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0095539{col 26}{space 2} .0040042{col 37}{space 1}   -2.39{col 46}{space 3}0.017{col 54}{space 4}-.0174019{col 67}{space 3}-.0017059
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_8
. mrmedian beta_outcome se_outcome beta_exposure se_exposure, weighted
{res}
{col 55}{txt}Number of genotypes = {res}62
{col 60}{txt}Replications = {res}1000
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}beta {c |}{col 14}{res}{space 2} .4887683{col 26}{space 2} .0372405{col 37}{space 1}   13.12{col 46}{space 3}0.000{col 54}{space 4} .4157782{col 67}{space 3} .5617584
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_9
. mrmodal beta_outcome se_outcome beta_exposure se_exposure, weighted
{res}
{col 55}{txt}Number of genotypes = {res}62
{col 60}{txt}Replications = {res}1000
{col 72}{txt}Phi = {res}1
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}beta {c |}{col 14}{res}{space 2}  .518945{col 26}{space 2} .0349531{col 37}{space 1}   14.85{col 46}{space 3}0.000{col 54}{space 4} .4504382{col 67}{space 3} .5874518
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/tom/Documents/GitHub/mrrobust/_drafts/markstat-call-R-example/markstat-call-R-example.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 6 Apr 2023, 10:58:13
{txt}{.-}
{smcl}
{txt}{sf}{ul off}